{
  "user": {
    "name": "CandyGZ",
    "login": "CandyGZ",
    "bio": null,
    "location": null,
    "email": null,
    "blog": "",
    "avatar_url": "https://avatars.githubusercontent.com/u/24537149?v=4",
    "public_repos": 73,
    "followers": 5,
    "following": 3
  },
  "repositories": [
    {
      "name": "CV-from-git",
      "description": "Genera automáticamente un CV profesional a partir de tus repositorios de GitHub, analizando lenguajes de programación y tecnologías empleadas. Este proyecto destaca por su análisis automático, detección inteligente de tecnologías, generación de CV en Markdown y HTML, y diseño profesional del CV en HTML. Además, permite la ejecución manual mediante GitHub Actions y actualización automática con commits automáticos. Las tecnologías detectadas incluyen diversos lenguajes de programación, frameworks, librerías y herramientas clave en el ámbito tecnológico.",
      "url": "https://github.com/CandyGZ/CV-from-git",
      "created_at": "2025-11-19T16:28:28+00:00",
      "updated_at": "2025-11-19T23:28:01+00:00",
      "languages": {
        "HTML": 34970,
        "Python": 28267
      },
      "technologies": [
        "pip",
        "Python"
      ],
      "stars": 0,
      "commits": 23,
      "topics": []
    },
    {
      "name": "CandyGZ",
      "description": "Proyecto CandyGZ: Colaboración en proyectos tecnológicos para startups, empresas y ONGs, con enfoque en escalabilidad y apoyo social. Especializado en tecnologías de vanguardia como AI, blockchain y criptomonedas, buscando impacto positivo en áreas como educación y protección infantil. Disponible para colaboraciones estratégicas basadas en equidad o reparto de ingresos.",
      "url": "https://github.com/CandyGZ/CandyGZ",
      "created_at": "2022-08-08T15:49:07+00:00",
      "updated_at": "2025-11-19T22:48:49+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 382,
      "topics": []
    },
    {
      "name": "tamago",
      "description": "Desarrollé \"Tamago\", un proyecto de mascota de escritorio 3D interactivo inspirado en Tamagotchi para Windows 11. Con un sistema completo tipo Tamagotchi, interacciones visuales en 3D, sonidos sintetizados y funcionalidades interactivas como alimentación y reconocimiento de voz. Implementado con TypeScript, HTML, JavaScript, Three.js, npm y Node.js, proporcionando una experiencia envolvente y divertida para los usuarios.",
      "url": "https://github.com/CandyGZ/tamago",
      "created_at": "2025-11-19T06:26:15+00:00",
      "updated_at": "2025-11-19T18:34:04+00:00",
      "languages": {
        "TypeScript": 60111,
        "HTML": 13935,
        "JavaScript": 142
      },
      "technologies": [
        "TypeScript",
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 20,
      "topics": []
    },
    {
      "name": "interviewassist",
      "description": "Plataforma \"interviewassist\" que combina un backend en Python Flask para procesamiento de audio con un agente de escritorio en Node.js/Electron. Facilita la transcripción y la interacción con IA, utilizando tecnologías como Python, JavaScript, HTML y CSS. Requiere Python 3.10+, Node.js 16.x+, y FFmpeg para el procesamiento de audio. Instrucciones detalladas de instalación y ejecución disponibles en el README del proyecto.",
      "url": "https://github.com/CandyGZ/interviewassist",
      "created_at": "2025-11-19T16:00:20+00:00",
      "updated_at": "2025-11-19T16:15:30+00:00",
      "languages": {
        "Python": 61017,
        "JavaScript": 10775,
        "HTML": 1172,
        "CSS": 1148
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Asesor-tesis",
      "description": "Desarrollo de \"Asesor-tesis\", un sistema de IA especializado para estudiantes mexicanos en la culminación de sus tesis académicas. Incluye un chatbot 24/7, generador de temas personalizados, plan de trabajo adaptado y editor académico AI. Tecnologías destacadas: TypeScript, Next.js, React, Node.js, PLpgSQL; con énfasis en metodología, marco teórico y redacción académica.",
      "url": "https://github.com/CandyGZ/Asesor-tesis",
      "created_at": "2025-11-19T00:35:32+00:00",
      "updated_at": "2025-11-19T05:27:13+00:00",
      "languages": {
        "TypeScript": 294861,
        "PLpgSQL": 26785,
        "JavaScript": 2007,
        "CSS": 1545
      },
      "technologies": [
        "TypeScript",
        "Next.js",
        "React",
        "Node.js",
        "npm"
      ],
      "stars": 0,
      "commits": 13,
      "topics": []
    },
    {
      "name": "ticktets-wisp",
      "description": "Desarrollo de un sistema completo de venta de tickets de internet por tiempo con integración a Mikrotik RouterOS y MercadoPago. Destaca por su venta de tickets por tiempo, integración con MercadoPago y Mikrotik RouterOS, tickets amarrados a dirección MAC, envío automático de emails, chatbot AI con ChatGPT, panel de administración completo y diseño responsive. Requiere Node.js, Router Mikrotik, cuenta de MercadoPago, servidor SMTP y OpenAI API Key.",
      "url": "https://github.com/CandyGZ/ticktets-wisp",
      "created_at": "2025-11-18T03:49:22+00:00",
      "updated_at": "2025-11-19T05:11:46+00:00",
      "languages": {
        "TypeScript": 793636,
        "CSS": 1563,
        "JavaScript": 200
      },
      "technologies": [
        "TypeScript",
        "Next.js",
        "React",
        "Node.js",
        "npm"
      ],
      "stars": 0,
      "commits": 29,
      "topics": []
    },
    {
      "name": "ICD",
      "description": "Proyecto \"ICD\": Desarrollo de una aplicación web utilizando Python, HTML, JavaScript y CSS para optimizar procesos internos. Destaca por su interfaz intuitiva y funcionalidades personalizadas. Los detalles técnicos se encuentran documentados en el README del proyecto.",
      "url": "https://github.com/CandyGZ/ICD",
      "created_at": "2025-11-17T02:53:18+00:00",
      "updated_at": "2025-11-18T23:18:54+00:00",
      "languages": {
        "Python": 361920,
        "HTML": 78241,
        "JavaScript": 23407,
        "CSS": 14031
      },
      "technologies": [],
      "stars": 0,
      "commits": 20,
      "topics": []
    },
    {
      "name": "wibosoft_page",
      "description": "Proyecto \"wibosoft_page\": Plataforma web diseñada para optimizar la interacción con usuarios mediante una interfaz intuitiva. Incluye funcionalidades de personalización y adaptabilidad a diferentes dispositivos. Basado en tecnologías modernas para garantizar eficiencia y experiencia de usuario superior.",
      "url": "https://github.com/CandyGZ/wibosoft_page",
      "created_at": "2025-11-18T06:05:39+00:00",
      "updated_at": "2025-11-18T06:05:39+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Multiagent",
      "description": "Desarrollo de un sistema profesional de múltiples agentes de IA en Python para automatizar el desarrollo de software empresarial. Utiliza orquestación inteligente, refinamiento interactivo, ejecución paralela y análisis de seguridad. Incorpora funcionalidades como sistema de preguntas inteligente, SecurityAgent y gestión de tareas humanas. Diseñado con arquitectura escalable y basado en mejores prácticas de desarrollo.",
      "url": "https://github.com/CandyGZ/Multiagent",
      "created_at": "2025-11-16T23:38:32+00:00",
      "updated_at": "2025-11-17T04:14:36+00:00",
      "languages": {
        "Python": 202710
      },
      "technologies": [
        "pip",
        "Python"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "FinanceKids",
      "description": "FinanceKids\" es un juego Play-to-Earn con IA Generativa que combina aprendizaje de finanzas con entretenimiento, permitiéndote construir un imperio desde un puesto callejero. Con tecnologías como TypeScript, Solidity y Node.js, el proyecto destaca por su IA integrada, mecánicas de juego realistas y su enfoque en Blockchain & Web3. Con NPCs inteligentes, progresión realista y soporte para NFTs, ofrece una experiencia única donde cada partida es única.",
      "url": "https://github.com/CandyGZ/FinanceKids",
      "created_at": "2025-11-05T20:20:33+00:00",
      "updated_at": "2025-11-16T21:00:31+00:00",
      "languages": {
        "TypeScript": 444731,
        "Solidity": 35077,
        "CSS": 4295,
        "Shell": 634,
        "JavaScript": 496
      },
      "technologies": [
        "TypeScript",
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 36,
      "topics": []
    },
    {
      "name": "acuarios-rs",
      "description": "Proyecto \"acuarios-rs\": Sistema automatizado que genera videos de acuarios de 30 minutos diariamente utilizando IA y los sube a YouTube. Incorpora procesamiento de video inteligente, integración con YouTube, dashboard intuitivo y costos mensuales cercanos a $0. Tecnologías clave: TypeScript, Next.js, React, Node.js, npm.",
      "url": "https://github.com/CandyGZ/acuarios-rs",
      "created_at": "2025-11-16T15:11:01+00:00",
      "updated_at": "2025-11-16T15:12:40+00:00",
      "languages": {
        "TypeScript": 72346,
        "JavaScript": 13254,
        "CSS": 8706,
        "Procfile": 209
      },
      "technologies": [
        "TypeScript",
        "Next.js",
        "React",
        "Node.js",
        "npm"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "acuarios",
      "description": "Desarrollo de un sistema de gestión de acuarios que permite monitorizar y controlar de forma automatizada el entorno acuático. Utiliza tecnologías de IoT para recopilar datos de temperatura, pH y niveles de oxígeno. Interfaz amigable para el usuario con alertas en tiempo real.",
      "url": "https://github.com/CandyGZ/acuarios",
      "created_at": "2025-11-16T06:11:16+00:00",
      "updated_at": "2025-11-16T06:11:16+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Store",
      "description": "Proyecto Store: Desarrollo de un sistema de Punto de Venta en Laravel y PHP, destacando una interfaz ágil y funcionalidades clave como flujos de venta flexibles, cálculo automático de impuestos, gestión de clientes y control de pagos. Tecnologías utilizadas incluyen JavaScript, CSS, Blade, npm, Composer, PHP y Node.js, brindando una solución completa para la gestión de ventas y facturación.",
      "url": "https://github.com/CandyGZ/Store",
      "created_at": "2025-09-30T00:11:21+00:00",
      "updated_at": "2025-11-16T05:36:44+00:00",
      "languages": {
        "JavaScript": 1127242,
        "CSS": 823714,
        "Blade": 438270,
        "PHP": 250264
      },
      "technologies": [
        "npm",
        "Composer",
        "PHP",
        "Node.js"
      ],
      "stars": 0,
      "commits": 7,
      "topics": []
    },
    {
      "name": "pemx-erik",
      "description": "Desarrollo del sistema web \"pemx-erik\" para la gestión y control de operaciones de carga de buques en terminales petroleras. Utilizando JavaScript, Python, CSS, HTML y Batchfile, junto con tecnologías como pip y Django. Destaca por su capacidad de gestionar órdenes de carga, control de cargas parciales, reportes de inventario diario, gestión de catálogos y sistema de permisos por roles. Incluye una interfaz web intuitiva y documentación detallada para instalación y uso.",
      "url": "https://github.com/CandyGZ/pemx-erik",
      "created_at": "2025-11-04T01:47:45+00:00",
      "updated_at": "2025-11-16T04:11:03+00:00",
      "languages": {
        "JavaScript": 120685,
        "Python": 110974,
        "CSS": 96615,
        "HTML": 21263,
        "Batchfile": 5453
      },
      "technologies": [
        "pip",
        "Django",
        "Python"
      ],
      "stars": 0,
      "commits": 6,
      "topics": []
    },
    {
      "name": "cv--vercel",
      "description": "Desarrollé y desplegué el proyecto \"cv--vercel\" en Vercel, una innovadora aplicación web que utiliza IA para mejorar currículums y preparar a los usuarios para entrevistas laborales. Destaca por su análisis detallado de CVs, generación personalizada de currículums y simulación de entrevistas con preguntas generadas por IA. Tecnologías clave incluyen React, Flask, Supabase y pasarelas de pago como MercadoPago y PayPal. Impulsa tu carrera con esta herramienta única en su clase.",
      "url": "https://github.com/CandyGZ/cv--vercel",
      "created_at": "2025-10-15T17:21:18+00:00",
      "updated_at": "2025-11-13T09:40:12+00:00",
      "languages": {
        "JavaScript": 255117,
        "Python": 169888,
        "CSS": 18397,
        "PLpgSQL": 17726,
        "HTML": 1372,
        "Shell": 1333
      },
      "technologies": [
        "React",
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 313,
      "topics": []
    },
    {
      "name": "ScrumResumeForGoogleMeet",
      "description": "Aplicación para Google Meet que automatiza la generación de resúmenes Scrum Master durante reuniones. Con transcripción en tiempo real y análisis inteligente, extrae información clave de avances, bloqueadores y asignaciones por participante. Utiliza tecnologías como TypeScript, Node.js y Google Cloud Speech-to-Text, ofreciendo resúmenes profesionales en varios idiomas y una interfaz moderna integrada en Google Meet.",
      "url": "https://github.com/CandyGZ/ScrumResumeForGoogleMeet",
      "created_at": "2025-11-07T17:09:11+00:00",
      "updated_at": "2025-11-07T17:44:21+00:00",
      "languages": {
        "TypeScript": 42414,
        "HTML": 15501,
        "JavaScript": 12467,
        "Shell": 6199,
        "CSS": 5279
      },
      "technologies": [
        "TypeScript",
        "npm",
        "Node.js",
        "Express.js"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "TradingStrategy",
      "description": "Proyecto: TradingStrategy\n\nDesarrollé un sistema avanzado de trading automático con dinero ficticio, utilizando Inteligencia Artificial y análisis técnico para tomar decisiones de compra y venta de acciones y criptomonedas en tiempo real. Con características como cuenta ficticia, IA de trading, apalancamiento, análisis Fibonacci, indicadores técnicos, gestión de riesgo y reportes personalizados, este proyecto ofrece una simulación realista de operaciones financieras. Tecnologías clave incluyen Python, NumPy, Pandas, yfinance, entre otros.\n\n¡Impulsa tus operaciones financieras con nuestro TradingStrategy Emulator con IA!",
      "url": "https://github.com/CandyGZ/TradingStrategy",
      "created_at": "2023-10-09T16:02:36+00:00",
      "updated_at": "2025-11-05T17:35:24+00:00",
      "languages": {
        "Python": 91051
      },
      "technologies": [
        "pip",
        "NumPy",
        "Python",
        "Pandas"
      ],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Prompt2Play",
      "description": "Prompt2Play\" es un servidor MCP revolucionario que convierte descripciones en lenguaje natural en prototipos de juegos jugables en segundos. Destacando por su capacidad de generar experiencias completas y jugables, utiliza Kotlin y Java con Gradle. Sus características incluyen un pipeline de extremo a extremo, NPCs impulsados por IA, iteración inteligente, exportación multi-motor y análisis semántico de género automático.",
      "url": "https://github.com/CandyGZ/Prompt2Play",
      "created_at": "2025-11-04T22:58:06+00:00",
      "updated_at": "2025-11-05T17:24:03+00:00",
      "languages": {
        "Kotlin": 27986
      },
      "technologies": [
        "Java",
        "Gradle"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "pmex-docker",
      "description": "Desarrollo de un sistema web para la gestión y control de operaciones de carga de buques en terminales petroleras, con una **instalación simplificada mediante Docker**. Este proyecto utiliza Python, Django y Docker para ofrecer una solución completa, con scripts automatizados, respaldos automáticos y portabilidad total. Ideal para empresas que buscan una implementación rápida y eficiente sin necesidad de configuraciones complejas.",
      "url": "https://github.com/CandyGZ/pmex-docker",
      "created_at": "2025-11-04T06:05:42+00:00",
      "updated_at": "2025-11-04T19:18:59+00:00",
      "languages": {
        "Python": 71920,
        "HTML": 21263,
        "Batchfile": 16517,
        "JavaScript": 11554,
        "CSS": 4138,
        "Dockerfile": 404
      },
      "technologies": [
        "pip",
        "Docker",
        "Docker Compose",
        "Python",
        "Django"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "GithubIA",
      "description": "Desarrollo de un asistente de código con IA para GitHub, que automatiza revisiones y documentación dentro del flujo de trabajo de desarrollo. Utiliza Python, pip, FastAPI y la API de OpenAI para ofrecer sugerencias de revisión en Pull Requests y generar documentación detallada bajo demanda.",
      "url": "https://github.com/CandyGZ/GithubIA",
      "created_at": "2025-09-28T05:31:21+00:00",
      "updated_at": "2025-10-29T18:32:10+00:00",
      "languages": {
        "Python": 14641
      },
      "technologies": [
        "pip",
        "FastAPI",
        "Python"
      ],
      "stars": 0,
      "commits": 7,
      "topics": []
    },
    {
      "name": "pemex",
      "description": "Desarrollo de un sistema de Gestión de Inventario y Carga de Crudo para una empresa petrolera. El proyecto se enfoca en optimizar la disponibilidad de producto y la capacidad de almacenamiento a través de cálculos dinámicos. Se emplean tecnologías como JavaScript, CSS, Python y HTML, junto con herramientas como pip. La documentación detalla los procesos de cálculo de existencias, recibos y cargas, fundamentales para la gestión eficiente del inventario de crudo.",
      "url": "https://github.com/CandyGZ/pemex",
      "created_at": "2025-10-06T23:49:37+00:00",
      "updated_at": "2025-10-27T17:25:18+00:00",
      "languages": {
        "JavaScript": 121016,
        "CSS": 96615,
        "Python": 70711,
        "HTML": 21191
      },
      "technologies": [
        "pip",
        "Python"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "Pemex_proy",
      "description": "Desarrollo de un sistema de Gestión de Inventario y Carga de Crudo para una empresa petrolera. Este proyecto se enfoca en garantizar la disponibilidad de producto y optimizar la capacidad de almacenamiento a través de tecnologías como JavaScript, CSS, Python, Django y pip. Los cálculos dinámicos de existencia, recibo y cupo son fundamentales para asegurar una gestión eficiente del inventario de crudo.",
      "url": "https://github.com/CandyGZ/Pemex_proy",
      "created_at": "2025-10-26T18:41:36+00:00",
      "updated_at": "2025-10-26T18:41:58+00:00",
      "languages": {
        "JavaScript": 109131,
        "CSS": 96545,
        "Python": 68106,
        "HTML": 38497
      },
      "technologies": [
        "pip",
        "Django",
        "Python"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "la_dIAbla",
      "description": "Desarrollé la_dIAbla, un proyecto de IA para Meta Facebook utilizando Python y tecnologías como Flask y pip. El README incluye instrucciones detalladas para iniciar el servidor de desarrollo y realizar acciones como postear mensajes de prueba y verificar permisos de página a través de cURL.",
      "url": "https://github.com/CandyGZ/la_dIAbla",
      "created_at": "2025-10-18T22:37:08+00:00",
      "updated_at": "2025-10-23T15:26:54+00:00",
      "languages": {
        "Python": 18313
      },
      "technologies": [
        "Flask",
        "pip",
        "Python"
      ],
      "stars": 0,
      "commits": 11,
      "topics": []
    },
    {
      "name": "SlidesGeneratorIA",
      "description": "Desarrollé SlidesGeneratorIA, un sistema que automatiza la creación de presentaciones en PowerPoint a partir de un tema dado. Utiliza la API de OpenAI y la biblioteca python-pptx para generar presentaciones con diapositivas informativas y encabezados. Con integración de librerías clave como openai y python-pptx, permite a los usuarios simplemente escribir el tema deseado y obtener presentaciones profesionales de forma eficiente.",
      "url": "https://github.com/CandyGZ/SlidesGeneratorIA",
      "created_at": "2023-10-06T13:47:33+00:00",
      "updated_at": "2025-10-05T13:35:39+00:00",
      "languages": {
        "Python": 2307
      },
      "technologies": [],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "PrintingCenter",
      "description": "Desarrollé un sistema personalizado, PrintingCenter, para una empresa de impresión que requería seguimiento de pedidos pendientes. Diseñado en Python, este sistema permite gestionar eficientemente trabajos de impresión, encontrar y confirmar el último archivo trabajado, y generar informes de pedidos pendientes para el día siguiente. Con funcionalidades claras y detalladas en el README, PrintingCenter optimiza la gestión de trabajos de impresión, facilitando el flujo de trabajo diario en el centro de impresión.",
      "url": "https://github.com/CandyGZ/PrintingCenter",
      "created_at": "2023-10-06T01:16:36+00:00",
      "updated_at": "2025-10-05T13:34:42+00:00",
      "languages": {
        "Python": 5762
      },
      "technologies": [],
      "stars": 1,
      "commits": 5,
      "topics": []
    },
    {
      "name": "ToDoList-Flet",
      "description": "Desarrollé el proyecto ToDoList-Flet, una aplicación de gestión de tareas diseñada para facilitar la creación de listas de tareas simples para niños. Utilizando tecnologías como Flet, una biblioteca Python para interfaces de usuario, y una librería personalizada de checkbox, logré crear una interfaz interactiva y amigable para el usuario. El proyecto destaca por su enfoque en la usabilidad y la simplicidad, demostrando mi habilidad para trabajar con tecnologías innovadoras y crear soluciones prácticas.",
      "url": "https://github.com/CandyGZ/ToDoList-Flet",
      "created_at": "2023-10-23T17:05:04+00:00",
      "updated_at": "2025-10-05T13:32:48+00:00",
      "languages": {
        "Python": 14432
      },
      "technologies": [],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Virtual-Disk",
      "description": "Desarrollé el proyecto Virtual-Disk, una simulación de almacenamiento en bloques en Python, similar a Amazon EBS. Implementé la clase SimpleBlockStorage, la cual gestiona datos en bloques numerados para un acceso eficiente y directo. Mediante el archivo generado (mi_disco.dat), el proyecto permite escribir y leer datos en bloques específicos, destacando la eficiencia al manipular datos a nivel numérico. Esta solución refleja la esencia del almacenamiento en bloques utilizado en volúmenes como Amazon EBS o discos duros internos.",
      "url": "https://github.com/CandyGZ/Virtual-Disk",
      "created_at": "2025-08-25T18:20:25+00:00",
      "updated_at": "2025-10-05T13:30:51+00:00",
      "languages": {
        "Python": 2193
      },
      "technologies": [],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "API-detalles-producto",
      "description": "Desarrollé un API backend denominado \"API-detalles-producto\" que brinda todos los datos esenciales para respaldar una página de detalle de artículo, inspirada en plataformas de e-commerce. Esta API eficientemente entrega los detalles del producto requeridos, construida en Java con tecnologías como Maven. Permite obtener información detallada de productos a través de solicitudes REST, facilitando la integración y visualización de datos de manera efectiva. Tecnologías clave incluyen Spring Boot, Java 17, y funcionalidades para obtener descripciones y detalles de productos mediante endpoints definidos.",
      "url": "https://github.com/CandyGZ/API-detalles-producto",
      "created_at": "2025-09-17T04:04:42+00:00",
      "updated_at": "2025-10-05T13:28:45+00:00",
      "languages": {
        "Java": 39547
      },
      "technologies": [
        "Maven",
        "Java"
      ],
      "stars": 0,
      "commits": 9,
      "topics": [
        "api",
        "api-rest"
      ]
    },
    {
      "name": "ShapeCalculator",
      "description": "El proyecto **ShapeCalculator** es una aplicación en Python que permite calcular áreas, perímetros y diagonales de rectángulos y cuadrados, así como determinar cuántas veces una forma cabe dentro de otra. Ideal para estudiantes, ingenieros y matemáticos, este programa destaca por su precisión y eficiencia en el cálculo de propiedades geométricas. Con una estructura clara y un README detallado, ShapeCalculator ofrece una herramienta confiable para realizar cálculos geométricos de manera rápida y precisa en entornos educativos y profesionales.",
      "url": "https://github.com/CandyGZ/ShapeCalculator",
      "created_at": "2023-09-23T03:21:45+00:00",
      "updated_at": "2025-10-05T13:27:34+00:00",
      "languages": {
        "Python": 10533
      },
      "technologies": [],
      "stars": 1,
      "commits": 7,
      "topics": []
    },
    {
      "name": "CV_reviewer",
      "description": "CV_reviewer\" es un proyecto de revisión automática de currículums que agiliza el proceso de selección de personal. Utiliza algoritmos de procesamiento de lenguaje natural para analizar la relevancia y calidad de la información presentada en los CVs. Las tecnologías clave incluyen NLP y técnicas de machine learning para la clasificación y extracción de datos. El README proporciona detalles sobre la arquitectura del sistema, la integración de APIs y las métricas de evaluación de desempeño.",
      "url": "https://github.com/CandyGZ/CV_reviewer",
      "created_at": "2025-10-05T02:13:02+00:00",
      "updated_at": "2025-10-05T02:13:03+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Code-to-Mermaid-generator",
      "description": "Desarrollé el proyecto Code-to-Mermaid-generator, un script en TypeScript que transforma tu código en sintaxis Mermaid para Draw.io. Este script analiza tu proyecto de forma recursiva, identifica patrones clave con expresiones regulares y genera un modelo interno de la aplicación, representando las conexiones entre componentes en el backend (NestJS) y frontend (Next.js). Con un enfoque en la eficiencia y precisión, facilita la visualización de la arquitectura de tu proyecto de manera clara y concisa.",
      "url": "https://github.com/CandyGZ/Code-to-Mermaid-generator",
      "created_at": "2025-09-20T14:26:42+00:00",
      "updated_at": "2025-09-28T11:54:29+00:00",
      "languages": {
        "TypeScript": 8565
      },
      "technologies": [],
      "stars": 0,
      "commits": 5,
      "topics": []
    },
    {
      "name": "VaadinToHTML",
      "description": "Proyecto: VaadinToHTML\n\nTransformando una aplicación monolítica en un sistema de micro-frontends, el proyecto VaadinToHTML destaca por su innovadora migración sin reescribir la lógica de negocio. Mediante la re-arquitectura de una aplicación Vaadin 8 en una SPA moderna, se logró romper con la dependencia entre la UI y el backend, resucitando así una aplicación legacy con una interfaz compleja y rica en datos, utilizando tecnologías avanzadas y estrategias de deconstrucción sin precedentes.",
      "url": "https://github.com/CandyGZ/VaadinToHTML",
      "created_at": "2025-09-27T05:17:13+00:00",
      "updated_at": "2025-09-27T15:56:55+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 6,
      "topics": []
    },
    {
      "name": "CV-reviewer",
      "description": "Desarrollé un CV-reviewer que utiliza inteligencia artificial para revisar y mejorar currículums de manera automatizada. Este proyecto, implementado con JavaScript, Python, HTML y CSS, se apoya en tecnologías como npm y Node.js para ofrecer una experiencia eficiente y precisa en la optimización de CVs.",
      "url": "https://github.com/CandyGZ/CV-reviewer",
      "created_at": "2025-09-23T19:39:05+00:00",
      "updated_at": "2025-09-24T19:01:27+00:00",
      "languages": {
        "JavaScript": 22596,
        "Python": 15045,
        "HTML": 1721,
        "CSS": 366
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Subasteria",
      "description": "Proyecto: Subasteria\nImpulsa la eficiencia en la búsqueda de ofertas con Subasteria, una plataforma que facilita la identificación de la máxima oferta única. Desarrollado con TypeScript, Dockerfile, JavaScript y CSS, este proyecto utiliza tecnologías como Docker Compose para optimizar su despliegue. Su objetivo es brindar una experiencia de subastas simplificada y efectiva, destacando por su funcionalidad intuitiva y su capacidad para encontrar las mejores ofertas de manera ágil.",
      "url": "https://github.com/CandyGZ/Subasteria",
      "created_at": "2025-09-14T23:49:33+00:00",
      "updated_at": "2025-09-23T15:33:24+00:00",
      "languages": {
        "TypeScript": 108757,
        "Dockerfile": 1909,
        "JavaScript": 477,
        "Shell": 430,
        "CSS": 277
      },
      "technologies": [
        "Docker Compose"
      ],
      "stars": 0,
      "commits": 8,
      "topics": []
    },
    {
      "name": "Bartola",
      "description": "Desarrollé el proyecto Bartola, un Gestor Financiero Personal creado con Django. Permite la administración integral de ingresos, gastos y estrategias de pago. Destaca por su funcionalidad de seguimiento financiero y planificación personalizada, utilizando tecnologías como CSS, Python, Django y JavaScript para una experiencia completa y efectiva en la gestión de finanzas.",
      "url": "https://github.com/CandyGZ/Bartola",
      "created_at": "2025-09-09T16:33:23+00:00",
      "updated_at": "2025-09-11T19:14:41+00:00",
      "languages": {
        "CSS": 131280,
        "Python": 115300,
        "SCSS": 113215,
        "HTML": 109797,
        "JavaScript": 27734,
        "PHP": 2124
      },
      "technologies": [
        "pip",
        "Django",
        "Python"
      ],
      "stars": 0,
      "commits": 8,
      "topics": []
    },
    {
      "name": "Email_notifier",
      "description": "Desarrollé Email_notifier, un sistema de notificación por correo electrónico para recordatorios de tareas diarias. Este proyecto permite a los usuarios recibir alertas personalizadas y gestionar eficientemente sus actividades diarias. Implementado con tecnologías modernas, como Python y Flask, se destaca por su simplicidad de uso y eficacia en la gestión de correos electrónicos.",
      "url": "https://github.com/CandyGZ/Email_notifier",
      "created_at": "2025-09-01T14:59:18+00:00",
      "updated_at": "2025-09-01T14:59:19+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "EnglishTeacher",
      "description": "Proyecto \"EnglishTeacher\": Desarrollo de una aplicación en Python para la enseñanza interactiva del idioma inglés. Utilizando técnicas de procesamiento de lenguaje natural, el proyecto ofrece lecciones personalizadas y evaluaciones automatizadas.",
      "url": "https://github.com/CandyGZ/EnglishTeacher",
      "created_at": "2023-10-02T23:22:27+00:00",
      "updated_at": "2025-08-25T18:31:48+00:00",
      "languages": {
        "Python": 9767
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "neocoins2",
      "description": "Desarrollo del proyecto \"neocoins2\" enfocado en la creación de una plataforma de gestión de criptomonedas con funcionalidades avanzadas de transacciones y seguridad. Implementación de algoritmos de cifrado robustos para garantizar la protección de los datos sensibles de los usuarios.",
      "url": "https://github.com/CandyGZ/neocoins2",
      "created_at": "2025-04-17T20:55:03+00:00",
      "updated_at": "2025-04-17T20:55:03+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "NeoCoins",
      "description": "Desarrollé el proyecto NeoCoins, un Trading Game que combina Python, HTML, JavaScript y CSS para simular operaciones financieras en tiempo real. Con un enfoque en la experiencia del usuario, este proyecto destaca por su interactividad y funcionalidades avanzadas. Integrando análisis de mercado y decisiones estratégicas, NeoCoins ofrece una experiencia inmersiva para usuarios interesados en el mundo de las finanzas.",
      "url": "https://github.com/CandyGZ/NeoCoins",
      "created_at": "2025-04-17T02:27:12+00:00",
      "updated_at": "2025-04-17T02:58:00+00:00",
      "languages": {
        "Python": 13127,
        "HTML": 12068,
        "JavaScript": 3541,
        "CSS": 1109
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ValenteSys",
      "description": "Proyecto ValenteSys: Desarrollo de una aplicación web interactiva utilizando JavaScript, HTML, Python y CSS para optimizar la gestión de datos. Destaca por su enfoque en la usabilidad y la eficiencia, ofreciendo una experiencia intuitiva para los usuarios. Las tecnologías clave permiten una integración fluida de funcionalidades avanzadas y personalización. El README detalla la arquitectura modular y las instrucciones de implementación para garantizar un despliegue exitoso.",
      "url": "https://github.com/CandyGZ/ValenteSys",
      "created_at": "2025-04-09T19:29:02+00:00",
      "updated_at": "2025-04-10T18:40:07+00:00",
      "languages": {
        "JavaScript": 13020,
        "HTML": 11052,
        "Python": 9849,
        "CSS": 8782
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "DashboardIIMAS",
      "description": "Desarrollo de un panel interactivo para visualización de datos en tiempo real, implementado con Python, HTML y JavaScript. DashboardIIMAS permite a los usuarios monitorear información crítica de manera intuitiva y eficiente, integrando gráficos dinámicos y widgets personalizables.",
      "url": "https://github.com/CandyGZ/DashboardIIMAS",
      "created_at": "2025-03-14T01:56:59+00:00",
      "updated_at": "2025-03-14T01:58:53+00:00",
      "languages": {
        "Python": 25384,
        "HTML": 10758,
        "JavaScript": 1780
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "dashboard",
      "description": "Desarrollé un completo sistema de autenticación con Django utilizando SQLite, ideal para aplicaciones web que requieran seguridad en el registro, login, y gestión de contraseñas. Este proyecto ofrece funcionalidades clave como registro de usuarios, autenticación segura, gestión de sesiones, y recuperación de contraseñas, todo respaldado por tecnologías como Django, SQLite, y un stack frontend.",
      "url": "https://github.com/CandyGZ/dashboard",
      "created_at": "2025-03-07T17:33:11+00:00",
      "updated_at": "2025-03-07T18:42:39+00:00",
      "languages": {
        "Python": 19874,
        "HTML": 10758,
        "JavaScript": 1780
      },
      "technologies": [
        "pip",
        "Django",
        "Python"
      ],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "PlagueDetectorID",
      "description": "Desarrollo de software de reconocimiento de plagas, PlagueDetectorID, utilizando Python, C, Cython, C++, Fortran y HTML. Valor agregado en la detección y categorización precisa de plagas agrícolas. Implementación de tecnologías como pip para gestión de paquetes y Meson para construcción. README: \"# PestRecognition - Pest Recognition Software\".",
      "url": "https://github.com/CandyGZ/PlagueDetectorID",
      "created_at": "2025-02-13T18:35:31+00:00",
      "updated_at": "2025-02-17T19:35:47+00:00",
      "languages": {
        "Python": 14755666,
        "C": 386605,
        "Cython": 125737,
        "C++": 85980,
        "Fortran": 37029,
        "PowerShell": 25697,
        "HTML": 16287,
        "Meson": 4589,
        "Batchfile": 1389
      },
      "technologies": [
        "pip",
        "Python"
      ],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "PestRecognition",
      "description": "Desarrollé el software PestRecognition en Python, una herramienta innovadora para el reconocimiento de plagas. Esta solución técnica permite identificar de manera eficiente y precisa distintos tipos de plagas, optimizando así los procesos de control y prevención. Con funcionalidades especializadas y un enfoque en la facilidad de uso, PestRecognition se posiciona como una contribución valiosa en la gestión integrada de plagas.",
      "url": "https://github.com/LEAI-IIMAS/PestRecognition",
      "created_at": "2024-05-09T22:59:37+00:00",
      "updated_at": "2024-05-10T00:07:11+00:00",
      "languages": {
        "Python": 8055
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Weather-cards",
      "description": "Desarrollé Weather-cards, un proyecto utilizando React y componentes funcionales. Implementé módulos de estilos y CSS para crear tarjetas informativas de clima. Utilicé JavaScript, HTML y CSS, junto con tecnologías como React, npm y Node.js para garantizar una experiencia interactiva y actualizada con datos climáticos.",
      "url": "https://github.com/CandyGZ/Weather-cards",
      "created_at": "2022-06-30T04:57:17+00:00",
      "updated_at": "2023-10-05T18:03:35+00:00",
      "languages": {
        "JavaScript": 5368,
        "HTML": 4651,
        "CSS": 3176,
        "Shell": 53
      },
      "technologies": [
        "React",
        "npm",
        "Node.js"
      ],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "countclicker",
      "description": "Proyecto \"countclicker\": Aplicación web para contabilizar clics de manera interactiva y eficiente. Desarrollado con CSS, JavaScript y HTML, ofrece una interfaz intuitiva y funcionalidad optimizada para recopilar datos de interacción del usuario.",
      "url": "https://github.com/CandyGZ/countclicker",
      "created_at": "2022-07-09T04:26:14+00:00",
      "updated_at": "2023-10-05T18:03:30+00:00",
      "languages": {
        "CSS": 2062,
        "JavaScript": 1941,
        "HTML": 1662
      },
      "technologies": [],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "2DoList",
      "description": "Desarrollé y diseñé \"2DoList\", una aplicación web que combina JavaScript, HTML y CSS para crear una lista de tareas interactiva. Destaca por su estilo de escritura a mano, fondos de papel y la importación de fuentes de Google para una experiencia divertida y personalizada.",
      "url": "https://github.com/CandyGZ/2DoList",
      "created_at": "2022-08-02T23:51:54+00:00",
      "updated_at": "2023-10-05T18:03:25+00:00",
      "languages": {
        "JavaScript": 8890,
        "HTML": 7983,
        "CSS": 1969
      },
      "technologies": [],
      "stars": 1,
      "commits": 4,
      "topics": []
    },
    {
      "name": "ArithmeticArranger",
      "description": "Desarrollé el proyecto ArithmeticArranger como parte de un desafío en FreeCodeCamp. Esta aplicación, escrita en Python, permite organizar y mostrar problemas aritméticos de manera elegante y estructurada. Incluye funciones avanzadas como el uso de zip y maps para optimizar el código, ofreciendo una solución más eficiente. El archivo README proporciona detalles técnicos adicionales sobre el proyecto, brindando una visión profunda de su implementación y funcionalidades clave.",
      "url": "https://github.com/CandyGZ/ArithmeticArranger",
      "created_at": "2023-09-17T20:43:09+00:00",
      "updated_at": "2023-10-05T18:03:21+00:00",
      "languages": {
        "Python": 5679
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "Time_Calculator",
      "description": "Desarrollé el proyecto Time_Calculator en Python para calcular la hora final a partir de una hora y duración dadas. Este programa ofrece una solución eficiente y precisa para operaciones de tiempo, facilitando el cálculo de horarios con rapidez y exactitud. Utilizando Python, se logró implementar una función que simplifica el proceso de calcular tiempos, brindando una herramienta valiosa para diversas aplicaciones que requieran manejo de horarios de manera efectiva.",
      "url": "https://github.com/CandyGZ/Time_Calculator",
      "created_at": "2023-09-20T19:42:21+00:00",
      "updated_at": "2023-10-05T18:03:19+00:00",
      "languages": {
        "Python": 6761
      },
      "technologies": [],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "FCC-BudgetApp",
      "description": "Desarrollé la aplicación de presupuesto FCC-BudgetApp en Python, ofreciendo una plataforma intuitiva con categorías y gráficos para un seguimiento financiero eficiente. Implementé funcionalidades clave como la gestión detallada de gastos, visualización de datos a través de gráficos interactivos y un diseño centrado en la usabilidad.",
      "url": "https://github.com/CandyGZ/FCC-BudgetApp",
      "created_at": "2023-09-22T16:47:57+00:00",
      "updated_at": "2023-10-05T18:03:15+00:00",
      "languages": {
        "Python": 22705
      },
      "technologies": [],
      "stars": 1,
      "commits": 2,
      "topics": []
    },
    {
      "name": "FCC-ProbabilityCalc",
      "description": "Desarrollé el proyecto FCC-ProbabilityCalc para calcular las probabilidades de obtener una cantidad específica de bolas al elegir al azar x veces de un sombrero ciego. Implementado en Python, este proyecto destaca por su precisión en cálculos de probabilidades y su utilidad en escenarios de análisis estadístico. Las funcionalidades clave incluyen el cálculo preciso de posibilidades en experimentos de selección aleatoria.",
      "url": "https://github.com/CandyGZ/FCC-ProbabilityCalc",
      "created_at": "2023-09-26T23:55:40+00:00",
      "updated_at": "2023-10-05T18:03:00+00:00",
      "languages": {
        "Python": 5213
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "LandingPage-Pikachu",
      "description": "Desarrollé un proyecto de Landing Page Pikachu, una página web interactiva que simula la caída y rebote de Pokeballs mediante HTML, CSS y JavaScript. Destacando una animación realista de gravedad y rebote, este proyecto incorpora efectos físicos que brindan una experiencia visual única. Las tecnologías clave incluyen HTML para la estructura, CSS para estilos visuales y JavaScript para la lógica de animación.",
      "url": "https://github.com/CandyGZ/LandingPage-Pikachu",
      "created_at": "2023-10-05T17:34:31+00:00",
      "updated_at": "2023-10-05T18:02:29+00:00",
      "languages": {
        "HTML": 4524
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "repositorio-henry",
      "description": "Desarrollé y contribuí al proyecto \"repositorio-henry\", una plataforma educativa que facilita la gestión de tareas académicas. Implementé funcionalidades clave como la organización de tareas y recursos para mejorar la experiencia de aprendizaje. Tecnologías utilizadas incluyen Node.js para el backend y React para el frontend.",
      "url": "https://github.com/CandyGZ/repositorio-henry",
      "created_at": "2022-04-13T20:48:19+00:00",
      "updated_at": "2022-06-25T18:00:27+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "M1-Challenge",
      "description": "Proyecto \"M1-Challenge\": Desarrollo de una serie de ejercicios de programación en JavaScript utilizando npm y Node.js. El objetivo es completar el código en varios archivos para que pasen los tests proporcionados. El README detalla claramente los pasos a seguir para resolver el checkpoint, clonar el repositorio y ejecutar los tests de cada ejercicio de forma individual.",
      "url": "https://github.com/CandyGZ/M1-Challenge",
      "created_at": "2022-06-17T18:24:36+00:00",
      "updated_at": "2022-06-17T18:26:09+00:00",
      "languages": {
        "JavaScript": 25434
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Henry-M1",
      "description": "Proyecto \"Henry-M1\": Desarrollo de módulo educativo para la plataforma Henry, enfocado en Fundamentos de JavaScript. Utilizando JavaScript, Nunjucks, HTML y Python, junto con tecnologías como npm y Node.js, el proyecto ofrece una estructura clara de lecciones y ejercicios. El README proporciona instrucciones detalladas para visualizar el contenido y subir tareas, brindando una experiencia interactiva y educativa.",
      "url": "https://github.com/CandyGZ/Henry-M1",
      "created_at": "2022-06-07T00:44:38+00:00",
      "updated_at": "2022-06-07T05:31:27+00:00",
      "languages": {
        "JavaScript": 102537,
        "Nunjucks": 6996,
        "HTML": 2529,
        "Python": 264
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "2022-04-23-eevee147",
      "description": "Proyecto \"2022-04-23-eevee147\": Desarrollo de un desafío técnico en JavaScript para evaluar conceptos básicos. Utiliza tecnologías clave como JavaScript, npm y Node.js. El README proporciona instrucciones detalladas para resolver el checkpoint de manera individual, fomentando la investigación y el aprendizaje autodidacta.",
      "url": "https://github.com/soyhenry-checkpoints-4/2022-04-23-eevee147",
      "created_at": "2022-04-23T04:47:58+00:00",
      "updated_at": "2022-04-23T04:48:02+00:00",
      "languages": {
        "JavaScript": 15895
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Clase26",
      "description": "Proyecto Clase26:\nDesarrollo de Angry Birds Stage 2 con implementación de Clase Inheritance y manejo de imágenes. Proyecto realizado con JavaScript, HTML y CSS, destacando la integración de funcionalidades avanzadas y la mejora en la estructura del código para una experiencia de juego más dinámica y visualmente atractiva.",
      "url": "https://github.com/CandyGZ/Clase26",
      "created_at": "2022-03-24T22:55:41+00:00",
      "updated_at": "2022-03-24T22:58:24+00:00",
      "languages": {
        "JavaScript": 342373,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProyectoAlumn43",
      "description": "Desarrollé el ProyectoAlumn43, un proyecto de aprendizaje diseñado para estudiantes con bugs resueltos y listo para su implementación. Implementado con JavaScript, HTML y CSS, este proyecto destaca por su enfoque didáctico y práctico para mejorar habilidades de programación web. El README detalla la estructura del proyecto, las funciones clave y la forma de abordar posibles errores, brindando una experiencia de aprendizaje completa y enriquecedora en tecnologías web fundamentales.",
      "url": "https://github.com/CandyGZ/ProyectoAlumn43",
      "created_at": "2022-03-22T20:43:09+00:00",
      "updated_at": "2022-03-22T20:44:44+00:00",
      "languages": {
        "JavaScript": 3733948,
        "HTML": 630,
        "CSS": 78
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "CarreradeAutos",
      "description": "Desarrollé el proyecto CarreradeAutos, una aplicación web interactiva que combina JavaScript, CSS y HTML para crear una experiencia de carreras emocionante y visualmente atractiva. Implementé funcionalidades clave como selección de vehículos, pistas personalizadas y marcadores de tiempo para ofrecer una experiencia de juego dinámica y entretenida.",
      "url": "https://github.com/CandyGZ/CarreradeAutos",
      "created_at": "2022-03-22T17:22:02+00:00",
      "updated_at": "2022-03-22T17:22:49+00:00",
      "languages": {
        "JavaScript": 150079,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "CanguroParte1",
      "description": "Desarrollé la parte 1 del proyecto CanguroParte1, siguiendo las instrucciones del archivo sketch.js. Esta aplicación web, creada con JavaScript, HTML y CSS, tiene como objetivo ofrecer una solución innovadora. Destaca por su enfoque técnico y funcionalidades basadas en el desarrollo front-end.",
      "url": "https://github.com/CandyGZ/CanguroParte1",
      "created_at": "2022-03-18T01:12:18+00:00",
      "updated_at": "2022-03-18T01:13:29+00:00",
      "languages": {
        "JavaScript": 3296281,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Clase42-Alum",
      "description": "Proyecto Clase42-Alum: Plataforma web interactiva desarrollada con JavaScript, CSS y HTML para facilitar el aprendizaje en entornos educativos. Destaca por su diseño intuitivo y funcionalidades personalizables. Incluye características como seguimiento de progreso, creación de perfiles y acceso a recursos didácticos.",
      "url": "https://github.com/CandyGZ/Clase42-Alum",
      "created_at": "2022-03-18T00:32:47+00:00",
      "updated_at": "2022-03-18T00:33:27+00:00",
      "languages": {
        "JavaScript": 148619,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Clase40-alum",
      "description": "Proyecto \"Clase40-alum\" es una aplicación web desarrollada con JavaScript, CSS y HTML que facilita la gestión de alumnos para un entorno educativo. Destaca por su interfaz intuitiva, permitiendo registrar, visualizar y modificar información de estudiantes de manera eficiente. Incorpora funcionalidades clave como filtrado de datos y responsive design.",
      "url": "https://github.com/CandyGZ/Clase40-alum",
      "created_at": "2022-03-17T22:26:57+00:00",
      "updated_at": "2022-03-17T22:27:31+00:00",
      "languages": {
        "JavaScript": 144398,
        "CSS": 1885,
        "HTML": 1278
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase41",
      "description": "Desarrollé clase41, un proyecto de CV interactivo destinado a alumnos. Implementado con JavaScript, CSS y HTML, este proyecto proporciona una experiencia de usuario atractiva al tiempo que exhibe de manera clara y concisa la información relevante sobre habilidades y experiencia. Destacando un diseño limpio y funcional, clase41 permite a los usuarios visualizar y compartir su historial profesional de manera efectiva.",
      "url": "https://github.com/CandyGZ/clase41",
      "created_at": "2022-03-15T16:52:07+00:00",
      "updated_at": "2022-03-15T16:53:08+00:00",
      "languages": {
        "JavaScript": 147662,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase38",
      "description": "Desarrollé la aplicación clase38, un proyecto que consiste en una plataforma educativa interactiva para completar actividades académicas pendientes. Utilizando JavaScript, HTML y CSS, se implementó una interfaz intuitiva que permite a los usuarios finalizar tareas de forma eficiente. Esta solución tecnológica ofrece una experiencia fluida y personalizable, facilitando la gestión de labores académicas de manera efectiva.",
      "url": "https://github.com/CandyGZ/clase38",
      "created_at": "2022-03-11T17:24:30+00:00",
      "updated_at": "2022-03-11T17:25:05+00:00",
      "languages": {
        "JavaScript": 139979,
        "HTML": 1561,
        "CSS": 1230
      },
      "technologies": [],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "Alumn-Clase40",
      "description": "Desarrollé Alumn-Clase40, una plataforma educativa que utiliza JavaScript, CSS y HTML para ofrecer una experiencia interactiva y dinámica en el aula virtual. Implementé funcionalidades clave para mejorar la interacción entre estudiantes y profesores, promoviendo un aprendizaje efectivo.",
      "url": "https://github.com/CandyGZ/Alumn-Clase40",
      "created_at": "2022-03-10T15:48:48+00:00",
      "updated_at": "2022-03-10T15:49:52+00:00",
      "languages": {
        "JavaScript": 144398,
        "CSS": 1885,
        "HTML": 1278
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "StudClase38",
      "description": "Desarrollé StudClase38, una plataforma interactiva basada en JavaScript, HTML y CSS para la realización de actividades educativas. Este proyecto destaca por su enfoque colaborativo y su capacidad para mejorar la experiencia de aprendizaje. Incorpora funcionalidades avanzadas de interacción y dinamismo, brindando una solución innovadora para el sector educativo.",
      "url": "https://github.com/CandyGZ/StudClase38",
      "created_at": "2022-03-01T22:15:18+00:00",
      "updated_at": "2022-03-01T22:16:08+00:00",
      "languages": {
        "JavaScript": 207478,
        "HTML": 1516,
        "CSS": 86
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase24",
      "description": "Desarrollé el proyecto \"clase24\" para el estado final de una clase, utilizando JavaScript, HTML y CSS. Este proyecto, denominado \"Angry Birds Stage 1\", presenta una implementación inicial del famoso juego. El README proporciona detalles sobre la estructura del proyecto y su propósito.",
      "url": "https://github.com/CandyGZ/clase24",
      "created_at": "2022-02-24T23:57:21+00:00",
      "updated_at": "2022-02-24T23:58:25+00:00",
      "languages": {
        "JavaScript": 343414,
        "HTML": 545,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Sangria",
      "description": "Desarrollé el proyecto \"Sangria\" como ejercicio personal, utilizando JavaScript, HTML y CSS. Esta aplicación destaca por su diseño interactivo y funcionalidades dinámicas, demostrando mi habilidad para crear soluciones web atractivas y eficientes.",
      "url": "https://github.com/CandyGZ/Sangria",
      "created_at": "2022-02-18T18:43:36+00:00",
      "updated_at": "2022-02-18T18:44:28+00:00",
      "languages": {
        "JavaScript": 3292834,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "P-ndulo",
      "description": "Desarrollé el proyecto \"P-ndulo\", una aplicación web que simula el comportamiento de un péndulo. Utilizando JavaScript y HTML, implementé funcionalidades interactivas que permiten visualizar y estudiar el movimiento oscilatorio. El README incluye información detallada sobre la versión NC27, resaltando aspectos clave para su comprensión y uso.",
      "url": "https://github.com/CandyGZ/P-ndulo",
      "created_at": "2022-02-09T00:52:01+00:00",
      "updated_at": "2022-02-09T00:54:21+00:00",
      "languages": {
        "JavaScript": 5294186,
        "HTML": 570
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clasr27full",
      "description": "Desarrollo de la aplicación \"clasr27full\" utilizando JavaScript y HTML para facilitar la clasificación y gestión de datos. Destaca por su interfaz intuitiva y eficiencia en el manejo de grandes volúmenes de información. Las tecnologías clave incluyen JavaScript para la lógica del lado del cliente y HTML para la estructura de la interfaz.",
      "url": "https://github.com/CandyGZ/clasr27full",
      "created_at": "2022-01-26T01:45:30+00:00",
      "updated_at": "2022-01-26T01:46:07+00:00",
      "languages": {
        "JavaScript": 2331,
        "HTML": 625
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "c29stud",
      "description": "Desarrollo del proyecto \"c29stud\", enfocado en la implementación de AngryBirdsStage4 utilizando JavaScript, HTML y CSS. Destaca por su enfoque interactivo y didáctico, empleando tecnologías clave para la creación de aplicaciones web dinámicas. El README incluye detalles sobre la estructura del proyecto y su funcionalidad.",
      "url": "https://github.com/CandyGZ/c29stud",
      "created_at": "2022-01-20T19:33:06+00:00",
      "updated_at": "2022-01-20T19:34:29+00:00",
      "languages": {
        "JavaScript": 353620,
        "HTML": 629,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "RefClase28",
      "description": "Proyecto: RefClase28\n\nImpulsado por JavaScript, HTML y CSS, RefClase28, también conocido como finalC28, es un proyecto técnico que destaca por su enfoque en AngryBirdsStage4. Con funcionalidades innovadoras, este proyecto demuestra habilidades sólidas en desarrollo web y diseño de interfaces.",
      "url": "https://github.com/CandyGZ/RefClase28",
      "created_at": "2022-01-19T00:55:25+00:00",
      "updated_at": "2022-01-19T00:56:18+00:00",
      "languages": {
        "JavaScript": 353610,
        "HTML": 629,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C28v1-Prof",
      "description": "Desarrollé el proyecto C28v1-Prof, una plataforma web educativa que combina JavaScript, HTML y CSS para ofrecer una experiencia de aprendizaje completa y dinámica. Este proyecto destaca por su enfoque en la interactividad y la usabilidad, brindando a los usuarios una clase en línea enriquecedora y funcional.",
      "url": "https://github.com/CandyGZ/C28v1-Prof",
      "created_at": "2022-01-18T03:40:15+00:00",
      "updated_at": "2022-01-18T03:41:20+00:00",
      "languages": {
        "JavaScript": 706908,
        "HTML": 1254,
        "CSS": 92
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C28V1-Stud",
      "description": "Desarrollé el proyecto C28V1-Stud, una aplicación tipo resortera utilizando JavaScript, HTML y CSS. Presenta una funcionalidad de Angry Birds Stage 3 con la introducción de Constraints. Este proyecto destaca por su enfoque en la interacción de elementos y el uso de tecnologías web clave para crear una experiencia dinámica y entretenida.",
      "url": "https://github.com/CandyGZ/C28V1-Stud",
      "created_at": "2022-01-18T03:38:11+00:00",
      "updated_at": "2022-01-18T03:39:55+00:00",
      "languages": {
        "JavaScript": 353298,
        "HTML": 625,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C21v2prof",
      "description": "Desarrollo de la aplicación web C21v2prof utilizando JavaScript, HTML y CSS para ofrecer una plataforma interactiva y funcional. Destacando por su diseño moderno y su enfoque en la usabilidad, este proyecto integra tecnologías clave para garantizar una experiencia fluida y atractiva para el usuario.",
      "url": "https://github.com/CandyGZ/C21v2prof",
      "created_at": "2022-01-16T20:34:12+00:00",
      "updated_at": "2022-01-16T23:08:53+00:00",
      "languages": {
        "JavaScript": 3734,
        "HTML": 1164,
        "CSS": 138
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C21v2-Stud",
      "description": "Proyecto \"C21v2-Stud\": Desarrollo de una aplicación web utilizando JavaScript, HTML y CSS para ofrecer una plataforma de estudio interactiva. Destaca por su enfoque en la experiencia del usuario y la facilidad de uso. Presenta un README detallado que incluye la estructura del proyecto y guías de instalación y uso.",
      "url": "https://github.com/CandyGZ/C21v2-Stud",
      "created_at": "2021-11-11T20:56:28+00:00",
      "updated_at": "2022-01-16T20:16:39+00:00",
      "languages": {
        "JavaScript": 1035,
        "HTML": 388,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "ProyectoP-nduloNewton",
      "description": "Desarrollé el proyecto \"Péndulo Newton\", una aplicación en fase de desarrollo que tiene como objetivo servir como herramienta de práctica. Este proyecto, aunque incompleto, destaca por su enfoque en la simulación de un péndulo y sus principios físicos subyacentes. Utiliza tecnologías diversas para la implementación, promoviendo el aprendizaje y la experimentación en un entorno controlado.",
      "url": "https://github.com/CandyGZ/ProyectoP-nduloNewton",
      "created_at": "2021-12-02T18:34:35+00:00",
      "updated_at": "2021-12-02T18:34:41+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Reference-AndryBirds-c25",
      "description": "Proyecto: Reference-AndryBirds-c25\n\nDesarrollé la segunda fase de Angry Birds, llamada \"Angry Birds stage 2\", implementando Herencia de Clases e Integración de Imágenes en JavaScript, HTML y CSS. El proyecto destaca por su estructura orientada a objetos y su funcionalidad mejorada con imágenes.",
      "url": "https://github.com/CandyGZ/Reference-AndryBirds-c25",
      "created_at": "2021-12-01T00:42:48+00:00",
      "updated_at": "2021-12-01T00:45:50+00:00",
      "languages": {
        "JavaScript": 342311,
        "HTML": 567,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "C25",
      "description": "Proyecto \"C25\": Desarrollo de una actividad estudiantil para Angry Birds Stage 2 utilizando JavaScript, HTML y CSS. Proporciona una práctica interactiva para estudiantes, fomentando el aprendizaje a través de la diversión. Tecnologías clave: JavaScript, HTML, CSS.README: # angryBirdsStage2StudentActivity.",
      "url": "https://github.com/CandyGZ/C25",
      "created_at": "2021-12-01T00:07:15+00:00",
      "updated_at": "2021-12-01T00:09:14+00:00",
      "languages": {
        "JavaScript": 343599,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC21-Collision",
      "description": "Desarrollo de un algoritmo en JavaScript para detectar colisiones entre dos objetos en un entorno web, utilizando HTML y CSS. El proyecto \"ProC21-Collision\" ofrece una solución eficiente para la detección de colisiones, mejorando la interactividad y experiencia de usuario en aplicaciones web.",
      "url": "https://github.com/CandyGZ/ProC21-Collision",
      "created_at": "2021-11-11T20:58:00+00:00",
      "updated_at": "2021-11-30T22:08:14+00:00",
      "languages": {
        "JavaScript": 3293010,
        "HTML": 352,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "ProC25Reference",
      "description": "Desarrollo del proyecto \"ProC25Reference\", enfocado en proporcionar una referencia técnica precisa y detallada para la implementación de funciones clave. Destacando un enfoque en la eficiencia y la escalabilidad, este proyecto incluye una amplia documentación sobre las mejores prácticas y soluciones técnicas.",
      "url": "https://github.com/CandyGZ/ProC25Reference",
      "created_at": "2021-11-26T01:10:46+00:00",
      "updated_at": "2021-11-26T01:11:08+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC25V1",
      "description": "Desarrollo del proyecto \"ProC25V1\", una actividad estudiantil para Angry Birds Stage 2 que utiliza JavaScript, HTML y CSS. Aporta valor al ofrecer a los estudiantes una experiencia interactiva para mejorar sus habilidades de programación y diseño web.",
      "url": "https://github.com/CandyGZ/ProC25V1",
      "created_at": "2021-11-25T05:33:49+00:00",
      "updated_at": "2021-11-25T05:34:52+00:00",
      "languages": {
        "JavaScript": 343599,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC24",
      "description": "Proyecto: ProC24\nProC24 es un proyecto inspirado en Angry Birds, desarrollado con JavaScript, HTML y CSS. El objetivo principal de este proyecto es simular la dinámica de derribar cajas en un entorno virtual. Destaca por su enfoque interactivo y visualmente atractivo. La tecnología clave utilizada incluye JavaScript para la lógica del juego y HTML/CSS para la interfaz de usuario. El README proporciona detalles adicionales sobre la estructura del proyecto, con el título \"# TopplingBoxes\" indicando su funcionalidad principal de derribar cajas.",
      "url": "https://github.com/CandyGZ/ProC24",
      "created_at": "2021-11-23T03:01:09+00:00",
      "updated_at": "2021-11-23T03:01:49+00:00",
      "languages": {
        "JavaScript": 340795,
        "HTML": 427,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C22-V1",
      "description": "Desarrollé el proyecto C22-V1, una práctica estudiantil que consistió en la creación de una Bouncy Ball utilizando los lenguajes JavaScript, HTML y CSS. Implementé la física con el motor matter.js para lograr un efecto de rebote realista. El README destaca la creación de la bola y su interacción basada en la física, lo que resalta mi capacidad para trabajar con tecnologías de simulación y animación en la web.",
      "url": "https://github.com/CandyGZ/C22-V1",
      "created_at": "2021-11-23T02:29:40+00:00",
      "updated_at": "2021-11-23T02:31:01+00:00",
      "languages": {
        "JavaScript": 3632099,
        "HTML": 398,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Angrybirds-Stage2.5",
      "description": "Proyecto \"Angrybirds-Stage2.5\": Implementación de Angry Birds stage 2.5 con herencia de clases e imágenes, desarrollado en JavaScript, HTML y CSS. Destaca por su enfoque en la reutilización de código y la mejora visual del juego.",
      "url": "https://github.com/CandyGZ/Angrybirds-Stage2.5",
      "created_at": "2021-11-18T19:05:02+00:00",
      "updated_at": "2021-11-18T19:05:35+00:00",
      "languages": {
        "JavaScript": 342452,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Topplingboxes",
      "description": "Proyecto \"TopplingBoxes\" es una aplicación web desarrollada con JavaScript, HTML y CSS que permite la interacción visual con cajas en movimiento. Su propósito es demostrar habilidades de animación y diseño interactivo. Las tecnologías clave incluyen JavaScript para la lógica de movimiento, HTML para la estructura de la página y CSS para el estilo visual. El proyecto se enfoca en crear una experiencia dinámica para los usuarios mediante la manipulación de cajas en la interfaz.",
      "url": "https://github.com/CandyGZ/Topplingboxes",
      "created_at": "2021-11-18T19:03:41+00:00",
      "updated_at": "2021-11-18T19:04:10+00:00",
      "languages": {
        "JavaScript": 340787,
        "HTML": 427,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "MotoresF",
      "description": "Desarrollé el proyecto MotoresF, un boilerplate de motores físicos en JavaScript, HTML y CSS. Este boilerplate proporciona una base sólida para la implementación de motores físicos utilizando p5.play, facilitando así el desarrollo de aplicaciones interactivas. El README incluye instrucciones claras para su uso y personalización, lo que lo convierte en una herramienta valiosa para proyectos que requieren simulaciones físicas en un entorno web.",
      "url": "https://github.com/CandyGZ/MotoresF",
      "created_at": "2021-11-16T02:22:04+00:00",
      "updated_at": "2021-11-16T02:22:56+00:00",
      "languages": {
        "JavaScript": 3631520,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Trex-color",
      "description": "Desarrollé el proyecto \"Trex-color\" que consiste en una versión a color del clásico juego Trex. Implementado con JavaScript, HTML y CSS, este juego destaca por su interfaz visual atractiva y su funcionalidad entretenida. Las tecnologías clave utilizadas incluyen animaciones CSS para mejorar la experiencia de usuario, junto con lógica de programación en JavaScript para el funcionamiento del juego.",
      "url": "https://github.com/CandyGZ/Trex-color",
      "created_at": "2021-10-21T22:44:29+00:00",
      "updated_at": "2021-10-21T22:46:19+00:00",
      "languages": {
        "JavaScript": 3297112,
        "HTML": 354,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Trex",
      "description": "Desarrollé el proyecto \"Trex\", un juego interactivo implementado en JavaScript, HTML y CSS. Este proyecto destaca por su enfoque en la programación orientada a objetos y la interacción dinámica con el usuario a través de la web. Las tecnologías clave utilizadas incluyen JavaScript para la lógica del juego, HTML para la estructura y CSS para el diseño responsivo.",
      "url": "https://github.com/CandyGZ/Trex",
      "created_at": "2021-10-04T21:39:15+00:00",
      "updated_at": "2021-10-21T22:41:03+00:00",
      "languages": {
        "JavaScript": 3295765,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "workshop-todo-native-mobile",
      "description": "Proyecto \"workshop-todo-native-mobile\": Desarrollo de una aplicación de lista de tareas en React Native con integración de base de datos Astra DB, permitiendo su funcionamiento en dispositivos móviles Android e iOS, así como en navegadores web. Utiliza tecnologías como JavaScript, React, npm y Node.js para ofrecer una experiencia multiplataforma.",
      "url": "https://github.com/CandyGZ/workshop-todo-native-mobile",
      "created_at": "2021-08-26T15:26:03+00:00",
      "updated_at": "2021-08-26T15:29:30+00:00",
      "languages": {
        "JavaScript": 19748,
        "Shell": 201
      },
      "technologies": [
        "React",
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 145,
      "topics": []
    },
    {
      "name": "t-rex",
      "description": "Desarrollo de la aplicación \"t-rex\", un proyecto innovador que utiliza TypeScript, SCSS, HTML y JavaScript con tecnologías clave como Angular, npm y Node.js. Destaca por su enfoque en la eficiencia y la usabilidad, brindando una experiencia de usuario fluida y dinámica.",
      "url": "https://github.com/CandyGZ/t-rex",
      "created_at": "2021-08-17T13:48:20+00:00",
      "updated_at": "2021-08-17T13:48:43+00:00",
      "languages": {
        "TypeScript": 16844,
        "SCSS": 8476,
        "HTML": 2599,
        "JavaScript": 2325
      },
      "technologies": [
        "Angular",
        "TypeScript",
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "WebAdminFraccionamientos",
      "description": "Desarrollo del proyecto \"WebAdminFraccionamientos\" que integra el componente UI HybridMenu en Vaadin 8 basado en Spring Boot, con soporte completo para SpringNavigator. Tecnologías clave incluyen CSS, Java, TSQL, Maven, y destacadas funcionalidades como la personalización de menús y creación de vistas propias.",
      "url": "https://github.com/saulnoelm/WebAdminFraccionamientos",
      "created_at": "2019-05-23T05:35:11+00:00",
      "updated_at": "2020-03-26T03:37:06+00:00",
      "languages": {
        "CSS": 1572667,
        "Java": 1370099,
        "TSQL": 407498
      },
      "technologies": [
        "Maven",
        "Java"
      ],
      "stars": 0,
      "commits": 159,
      "topics": []
    },
    {
      "name": "anac",
      "description": "Desarrollo del proyecto \"anac\" enfocado en la optimización de procesos internos para una gestión más eficiente de datos y recursos. Utilizando tecnologías innovadoras, se logró implementar un sistema escalable que permitió mejorar significativamente la productividad del equipo. El proyecto incluye características como [detalles técnicos relevantes del README, si los hubiera].",
      "url": "https://github.com/CandyGZ/anac",
      "created_at": "2019-10-25T04:53:27+00:00",
      "updated_at": "2019-10-25T04:53:27+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    }
  ],
  "languages": {
    "JavaScript": 61.74,
    "Python": 24.92,
    "CSS": 4.55,
    "TypeScript": 2.81,
    "Java": 2.15,
    "HTML": 0.71,
    "Blade": 0.67,
    "TSQL": 0.62,
    "C": 0.59,
    "PHP": 0.39,
    "Cython": 0.19,
    "SCSS": 0.19,
    "C++": 0.13,
    "PLpgSQL": 0.07,
    "Fortran": 0.06,
    "Solidity": 0.05,
    "Kotlin": 0.04,
    "PowerShell": 0.04,
    "Batchfile": 0.04,
    "Shell": 0.01,
    "Nunjucks": 0.01,
    "Meson": 0.01,
    "Dockerfile": 0.0,
    "Procfile": 0.0
  },
  "technologies": [
    "Angular",
    "Composer",
    "Django",
    "Docker",
    "Docker Compose",
    "Express.js",
    "FastAPI",
    "Flask",
    "Gradle",
    "Java",
    "Maven",
    "Next.js",
    "Node.js",
    "NumPy",
    "PHP",
    "Pandas",
    "Python",
    "React",
    "TypeScript",
    "npm",
    "pip"
  ],
  "generated_at": "2025-11-19T23:34:34.108603"
}