{
  "user": {
    "name": "CandyGZ",
    "login": "CandyGZ",
    "bio": null,
    "location": null,
    "email": null,
    "blog": "",
    "avatar_url": "https://avatars.githubusercontent.com/u/24537149?v=4",
    "public_repos": 73,
    "followers": 5,
    "following": 3
  },
  "repositories": [
    {
      "name": "CV-from-git",
      "description": "CV-from-git\" es un generador automático de CV profesional basado en tus repositorios de GitHub. Analiza tus repositorios públicos, detecta lenguajes de programación y tecnologías utilizadas, y crea un CV atractivo en Markdown y HTML. Incluye análisis inteligente de lenguajes, detección de tecnologías, descripciones mejoradas con IA, diseño profesional y ejecución manual mediante GitHub Actions para una actualización automática constante.",
      "url": "https://github.com/CandyGZ/CV-from-git",
      "created_at": "2025-11-19T16:28:28+00:00",
      "updated_at": "2025-11-19T20:13:24+00:00",
      "languages": {
        "Python": 27915,
        "HTML": 13966
      },
      "technologies": [
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 14,
      "topics": []
    },
    {
      "name": "CandyGZ",
      "description": "Proyecto CandyGZ: Iniciativa tecnológica para impulsar startups, negocios y ONGs a través de soluciones innovadoras. Enfocado en áreas como IA, blockchain, criptomonedas y apoyo social, con disposición para colaboraciones estratégicas. Se destaca por su enfoque pro-bono y potencial de escalabilidad a través de la tecnología.",
      "url": "https://github.com/CandyGZ/CandyGZ",
      "created_at": "2022-08-08T15:49:07+00:00",
      "updated_at": "2025-11-19T18:37:02+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 374,
      "topics": []
    },
    {
      "name": "tamago",
      "description": "Desarrollé \"Tamago\", un proyecto que consiste en una mascota de escritorio 3D interactiva tipo Tamagotchi para Windows 11. Utilizando TypeScript, HTML y JavaScript, implementé un sistema completo Tamagotchi con estadísticas vitales, modelo 3D animado renderizado con Three.js, sonidos sintetizados generados con Web Audio API, y funcionalidades interactivas como alimentación y reconocimiento de voz.",
      "url": "https://github.com/CandyGZ/tamago",
      "created_at": "2025-11-19T06:26:15+00:00",
      "updated_at": "2025-11-19T18:34:04+00:00",
      "languages": {
        "TypeScript": 60111,
        "HTML": 13935,
        "JavaScript": 142
      },
      "technologies": [
        "npm",
        "Node.js",
        "TypeScript"
      ],
      "stars": 0,
      "commits": 20,
      "topics": []
    },
    {
      "name": "interviewassist",
      "description": "Proyecto \"Interview Assist\": Plataforma que combina un backend en Python Flask para procesamiento de audio con un agente de escritorio en Node.js/Electron, diseñado para asistir en entrevistas mediante transcripciones y comunicación con IA. Requiere Python 3.10+, Node.js 16.x+, y FFmpeg para procesamiento de audio. Ofrece funcionalidades avanzadas de transcripción y captura de audio, facilitando la interacción con la inteligencia artificial.",
      "url": "https://github.com/CandyGZ/interviewassist",
      "created_at": "2025-11-19T16:00:20+00:00",
      "updated_at": "2025-11-19T16:15:30+00:00",
      "languages": {
        "Python": 61017,
        "JavaScript": 10775,
        "HTML": 1172,
        "CSS": 1148
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Asesor-tesis",
      "description": "Desarrollador principal del proyecto \"Asesor-tesis\", un sistema de IA innovador que brinda asistencia personalizada a estudiantes mexicanos para completar sus tesis académicas de manera eficiente. Utilizando TypeScript, PLpgSQL, JavaScript y CSS, junto con tecnologías como React, Node.js y Next.js, se destacan características como un Chat IA 24/7, Generador de Temas personalizados, Plan de Trabajo adaptado y Editor Académico AI para garantizar un proceso de investigación y redacción académica sin estrés.",
      "url": "https://github.com/CandyGZ/Asesor-tesis",
      "created_at": "2025-11-19T00:35:32+00:00",
      "updated_at": "2025-11-19T05:27:13+00:00",
      "languages": {
        "TypeScript": 294861,
        "PLpgSQL": 26785,
        "JavaScript": 2007,
        "CSS": 1545
      },
      "technologies": [
        "TypeScript",
        "npm",
        "React",
        "Node.js",
        "Next.js"
      ],
      "stars": 0,
      "commits": 13,
      "topics": []
    },
    {
      "name": "ticktets-wisp",
      "description": "Proyecto \"tickets-wisp\": Sistema completo de venta de tickets de internet por tiempo, con integración a Mikrotik RouterOS y MercadoPago. Desarrollado en TypeScript, CSS y JavaScript, utilizando tecnologías como React, Node.js y Next.js. Características incluyen venta de tickets por tiempo, integración con MercadoPago y Mikrotik RouterOS, chatbot AI con ChatGPT, panel de administración completo y diseño responsive. Requiere Node.js 18, Router Mikrotik con API, cuenta de MercadoPago, servidor SMTP y OpenAI API Key.",
      "url": "https://github.com/CandyGZ/ticktets-wisp",
      "created_at": "2025-11-18T03:49:22+00:00",
      "updated_at": "2025-11-19T05:11:46+00:00",
      "languages": {
        "TypeScript": 793636,
        "CSS": 1563,
        "JavaScript": 200
      },
      "technologies": [
        "TypeScript",
        "npm",
        "React",
        "Node.js",
        "Next.js"
      ],
      "stars": 0,
      "commits": 29,
      "topics": []
    },
    {
      "name": "ICD",
      "description": "Desarrollo de un sistema de diagnóstico médico automatizado utilizando Python para el backend y HTML, JavaScript y CSS para la interfaz de usuario. ICD proporciona una herramienta precisa y eficiente para la clasificación de enfermedades basada en códigos internacionales, mejorando la precisión y la rapidez del proceso de diagnóstico.",
      "url": "https://github.com/CandyGZ/ICD",
      "created_at": "2025-11-17T02:53:18+00:00",
      "updated_at": "2025-11-18T23:18:54+00:00",
      "languages": {
        "Python": 361920,
        "HTML": 78241,
        "JavaScript": 23407,
        "CSS": 14031
      },
      "technologies": [],
      "stars": 0,
      "commits": 20,
      "topics": []
    },
    {
      "name": "wibosoft_page",
      "description": "Desarrollo de un proyecto web llamado \"wibosoft_page\" que ofrece una solución innovadora para la gestión eficiente de contenido en línea. Utiliza tecnologías avanzadas para garantizar un rendimiento óptimo y una experiencia de usuario excepcional. El README destaca la integración de API RESTful y el uso de metodologías ágiles para el desarrollo continuo.",
      "url": "https://github.com/CandyGZ/wibosoft_page",
      "created_at": "2025-11-18T06:05:39+00:00",
      "updated_at": "2025-11-18T06:05:39+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Multiagent",
      "description": "Sistema profesional de múltiples agentes de IA en Python para desarrollo automático de software empresarial. Utiliza agentes de IA en paralelo con orquestación inteligente, refinamiento interactivo, ejecución paralela, auto-organización, CI/CD integrado, análisis de seguridad y arquitectura escalable. Incluye nuevas funcionalidades como sistema de preguntas inteligente, SecurityAgent, gestión de tareas humanas y testing web híbrido.",
      "url": "https://github.com/CandyGZ/Multiagent",
      "created_at": "2025-11-16T23:38:32+00:00",
      "updated_at": "2025-11-17T04:14:36+00:00",
      "languages": {
        "Python": 202710
      },
      "technologies": [
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "FinanceKids",
      "description": "FinanceKids es un juego Play-to-Earn que combina finanzas y entretenimiento, ofreciendo una experiencia única de emprendimiento latinoamericano con IA generativa. Destacando por su IA integrada, mecánicas de juego realistas y elementos blockchain, incluyendo el uso de TypeScript, Solidity y Node.js, entre otras tecnologías clave.",
      "url": "https://github.com/CandyGZ/FinanceKids",
      "created_at": "2025-11-05T20:20:33+00:00",
      "updated_at": "2025-11-16T21:00:31+00:00",
      "languages": {
        "TypeScript": 444731,
        "Solidity": 35077,
        "CSS": 4295,
        "Shell": 634,
        "JavaScript": 496
      },
      "technologies": [
        "npm",
        "Node.js",
        "TypeScript"
      ],
      "stars": 0,
      "commits": 36,
      "topics": []
    },
    {
      "name": "acuarios-rs",
      "description": "Acuarios-rs es un sistema automatizado que genera videos de acuarios de 30 minutos diariamente mediante inteligencia artificial y los sube a YouTube. Con un costo mensual de aproximadamente $0, utiliza tecnologías como TypeScript, React y Node.js, ofreciendo características como generación completamente automatizada, procesamiento inteligente de videos y una integración perfecta con YouTube.",
      "url": "https://github.com/CandyGZ/acuarios-rs",
      "created_at": "2025-11-16T15:11:01+00:00",
      "updated_at": "2025-11-16T15:12:40+00:00",
      "languages": {
        "TypeScript": 72346,
        "JavaScript": 13254,
        "CSS": 8706,
        "Procfile": 209
      },
      "technologies": [
        "TypeScript",
        "npm",
        "React",
        "Node.js",
        "Next.js"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "acuarios",
      "description": "Desarrollo de un sistema de gestión de acuarios para monitorear y controlar de forma eficiente las condiciones del agua, la iluminación y la alimentación de los peces. Destaca por su interfaz intuitiva, alertas personalizadas y capacidad de automatización. Incluye sensores de temperatura, pH y oxígeno.",
      "url": "https://github.com/CandyGZ/acuarios",
      "created_at": "2025-11-16T06:11:16+00:00",
      "updated_at": "2025-11-16T06:11:16+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Store",
      "description": "Proyecto Store: Aplicación de Punto de Venta desarrollada en Laravel y PHP, diseñada para gestionar de forma eficiente ventas, pedidos y facturación. Destaca por su interfaz rápida, flujos de venta flexibles, cálculo automático de impuestos y gestión detallada de clientes y pagos. Utiliza tecnologías como JavaScript, CSS, Blade, npm, Node.js y Composer para ofrecer una experiencia completa y funcional.",
      "url": "https://github.com/CandyGZ/Store",
      "created_at": "2025-09-30T00:11:21+00:00",
      "updated_at": "2025-11-16T05:36:44+00:00",
      "languages": {
        "JavaScript": 1127242,
        "CSS": 823714,
        "Blade": 438270,
        "PHP": 250264
      },
      "technologies": [
        "npm",
        "Node.js",
        "Composer",
        "PHP"
      ],
      "stars": 0,
      "commits": 7,
      "topics": []
    },
    {
      "name": "pemx-erik",
      "description": "Desarrollo del sistema web \"pemx-erik\" para la gestión y control de operaciones de carga de buques en terminales petroleras. Utiliza JavaScript, Python, CSS, HTML y Batchfile, con tecnologías como Django y pip. Destaca por su gestión de órdenes de carga, control de cargas parciales, reportes diarios y sistema de permisos por roles, ofreciendo una interfaz web intuitiva y funcional. Los pasos de instalación detallados y la documentación técnica brindan una guía completa para su implementación y uso eficiente.",
      "url": "https://github.com/CandyGZ/pemx-erik",
      "created_at": "2025-11-04T01:47:45+00:00",
      "updated_at": "2025-11-16T04:11:03+00:00",
      "languages": {
        "JavaScript": 120685,
        "Python": 110974,
        "CSS": 96615,
        "HTML": 21263,
        "Batchfile": 5453
      },
      "technologies": [
        "Python",
        "pip",
        "Django"
      ],
      "stars": 0,
      "commits": 6,
      "topics": []
    },
    {
      "name": "cv--vercel",
      "description": "Proyecto: cv--vercel\n\nAplicación web que utiliza inteligencia artificial para potenciar currículums y preparar a usuarios para entrevistas laborales. Ofrece análisis detallado de CVs, generación personalizada de currículums y simulación de entrevistas con IA. Desarrollado con React, Vite, Flask (Python) y Supabase para base de datos y autenticación. Integra pasarelas de pago MercadoPago y PayPal. Configuración local detallada para Node.js v18+, Python v3.9+ y cuenta en Supabase.",
      "url": "https://github.com/CandyGZ/cv--vercel",
      "created_at": "2025-10-15T17:21:18+00:00",
      "updated_at": "2025-11-13T09:40:12+00:00",
      "languages": {
        "JavaScript": 255117,
        "Python": 169888,
        "CSS": 18397,
        "PLpgSQL": 17726,
        "HTML": 1372,
        "Shell": 1333
      },
      "technologies": [
        "npm",
        "Node.js",
        "React"
      ],
      "stars": 0,
      "commits": 313,
      "topics": []
    },
    {
      "name": "ScrumResumeForGoogleMeet",
      "description": "Aplicación para Google Meet Marketplace que genera automáticamente resúmenes tipo Scrum Master durante las reuniones, extrayendo información estructurada sobre avances, bloqueadores y nuevas asignaciones por cada asistente. Utiliza TypeScript, HTML, JavaScript, Shell y CSS, con tecnologías como npm, Node.js y Express.js. Destaca por su transcripción en tiempo real, análisis inteligente con IA, identificación automática de participantes y soporte multiidioma, entre otras características. Su arquitectura incluye Google Cloud Speech-to-Text API, OpenAI GPT-4, HTML5, CSS3, JavaScript Vanilla y despliegue en Google Cloud Platform.",
      "url": "https://github.com/CandyGZ/ScrumResumeForGoogleMeet",
      "created_at": "2025-11-07T17:09:11+00:00",
      "updated_at": "2025-11-07T17:44:21+00:00",
      "languages": {
        "TypeScript": 42414,
        "HTML": 15501,
        "JavaScript": 12467,
        "Shell": 6199,
        "CSS": 5279
      },
      "technologies": [
        "npm",
        "Node.js",
        "TypeScript",
        "Express.js"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "TradingStrategy",
      "description": "TradingStrategy es un sistema avanzado de trading automático con dinero ficticio que emplea Inteligencia Artificial, análisis técnico y precios en tiempo real para realizar operaciones de compra y venta de acciones y criptomonedas. Con características como apalancamiento, análisis Fibonacci, indicadores técnicos, gestión de riesgo y reportes personalizados, este proyecto utiliza Python junto con Pandas, NumPy y otras tecnologías para proporcionar una experiencia de trading simulada completa y realista.",
      "url": "https://github.com/CandyGZ/TradingStrategy",
      "created_at": "2023-10-09T16:02:36+00:00",
      "updated_at": "2025-11-05T17:35:24+00:00",
      "languages": {
        "Python": 91051
      },
      "technologies": [
        "Pandas",
        "NumPy",
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Prompt2Play",
      "description": "Prompt2Play\" es un servidor MCP revolucionario que convierte descripciones de texto en prototipos de juegos jugables en segundos, democratizando el desarrollo de juegos. Utilizando Kotlin y Java con Gradle, destaca por generar experiencias jugables completas a partir de simples descripciones, incorporando características como NPCs impulsados por IA, iteración inteligente y exportación multi-engine a Phaser, Unity y Godot.",
      "url": "https://github.com/CandyGZ/Prompt2Play",
      "created_at": "2025-11-04T22:58:06+00:00",
      "updated_at": "2025-11-05T17:24:03+00:00",
      "languages": {
        "Kotlin": 27986
      },
      "technologies": [
        "Java",
        "Gradle"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "pmex-docker",
      "description": "Desarrollo del Sistema de Gestión de Carga de Buques (SGCB) para terminales petroleras, con instalación simplificada a través de Docker. Utiliza Django, PostgreSQL y Docker Compose, ofreciendo una implementación rápida y sin configuraciones adicionales. Incluye scripts automatizados, respaldos automáticos y portabilidad total para una gestión eficiente de operaciones de carga.",
      "url": "https://github.com/CandyGZ/pmex-docker",
      "created_at": "2025-11-04T06:05:42+00:00",
      "updated_at": "2025-11-04T19:18:59+00:00",
      "languages": {
        "Python": 71920,
        "HTML": 21263,
        "Batchfile": 16517,
        "JavaScript": 11554,
        "CSS": 4138,
        "Dockerfile": 404
      },
      "technologies": [
        "Docker",
        "Django",
        "Docker Compose",
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "GithubIA",
      "description": "GithubIA\" es un asistente de código basado en IA para GitHub que automatiza tareas de desarrollo como revisiones de código y generación de documentación. Utilizando Python, pip y FastAPI, este proyecto integra la API de OpenAI para proporcionar sugerencias detalladas directamente en los Pull Requests, agilizando el proceso de revisión y mejorando la calidad del código de manera eficiente.",
      "url": "https://github.com/CandyGZ/GithubIA",
      "created_at": "2025-09-28T05:31:21+00:00",
      "updated_at": "2025-10-29T18:32:10+00:00",
      "languages": {
        "Python": 14641
      },
      "technologies": [
        "Python",
        "pip",
        "FastAPI"
      ],
      "stars": 0,
      "commits": 7,
      "topics": []
    },
    {
      "name": "pemex",
      "description": "Proyecto \"pemex\": Sistema de Gestión de Inventario y Carga de Crudo para terminales petroleras, utilizando JavaScript, CSS, Python y HTML. Implementa cálculos dinámicos de existencia, recibo y carga de crudo, asegurando la disponibilidad y optimización de almacenamiento. Tecnologías clave: Python, pip. Detalles en README: Proceso secuencial de cálculos diarios basados en existencia inicial y final, recibo total del día y carga total a buques.",
      "url": "https://github.com/CandyGZ/pemex",
      "created_at": "2025-10-06T23:49:37+00:00",
      "updated_at": "2025-10-27T17:25:18+00:00",
      "languages": {
        "JavaScript": 121016,
        "CSS": 96615,
        "Python": 70711,
        "HTML": 21191
      },
      "technologies": [
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "Pemex_proy",
      "description": "Proyecto \"Pemex_proy\": Sistema de Gestión de Inventario y Carga de Crudo para terminales petroleras. Utiliza JavaScript, CSS, Python, HTML y Django para optimizar la disponibilidad de producto, cálculo de volúmenes y capacidad de almacenamiento. Con cálculos dinámicos de existencia, recibo y cupo, garantiza una administración eficiente y precisa del crudo en la terminal.",
      "url": "https://github.com/CandyGZ/Pemex_proy",
      "created_at": "2025-10-26T18:41:36+00:00",
      "updated_at": "2025-10-26T18:41:58+00:00",
      "languages": {
        "JavaScript": 109131,
        "CSS": 96545,
        "Python": 68106,
        "HTML": 38497
      },
      "technologies": [
        "Python",
        "pip",
        "Django"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "la_dIAbla",
      "description": "Proyecto la_dIAbla: Desarrollo de un sistema de IA para Meta Facebook utilizando Python y tecnologías como Flask y pip. Incluye funcionalidades para iniciar el servidor de desarrollo, postear mensajes y verificar permisos de página a través de comandos específicos en el README.",
      "url": "https://github.com/CandyGZ/la_dIAbla",
      "created_at": "2025-10-18T22:37:08+00:00",
      "updated_at": "2025-10-23T15:26:54+00:00",
      "languages": {
        "Python": 18313
      },
      "technologies": [
        "Flask",
        "Python",
        "pip"
      ],
      "stars": 0,
      "commits": 11,
      "topics": []
    },
    {
      "name": "SlidesGeneratorIA",
      "description": "SlidesGeneratorIA es un sistema innovador diseñado para automatizar la creación de presentaciones en PowerPoint sobre un tema específico. Utilizando la API de OpenAI y la biblioteca python-pptx, genera diapositivas con encabezados y contenido informativo de forma eficiente. Con funciones como la configuración de clave de API, interacción con el modelo GPT-3 de OpenAI y generación de contenido a medida, este proyecto demuestra un enfoque avanzado en la generación automatizada de presentaciones.",
      "url": "https://github.com/CandyGZ/SlidesGeneratorIA",
      "created_at": "2023-10-06T13:47:33+00:00",
      "updated_at": "2025-10-05T13:35:39+00:00",
      "languages": {
        "Python": 2307
      },
      "technologies": [],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "PrintingCenter",
      "description": "Proyecto PrintingCenter: Un sistema personalizado para un centro de impresión que permite el seguimiento de órdenes pendientes. Desarrollado en Python, esta herramienta facilita la gestión de trabajos de impresión al encontrar y mostrar el archivo más reciente con información sobre los trabajos pendientes, permitiendo confirmar trabajos completados y generar informes para la jornada siguiente.",
      "url": "https://github.com/CandyGZ/PrintingCenter",
      "created_at": "2023-10-06T01:16:36+00:00",
      "updated_at": "2025-10-05T13:34:42+00:00",
      "languages": {
        "Python": 5762
      },
      "technologies": [],
      "stars": 1,
      "commits": 5,
      "topics": []
    },
    {
      "name": "ToDoList-Flet",
      "description": "Desarrollé el proyecto ToDoList-Flet, una aplicación de gestión de tareas diseñada para facilitar la creación de listas de tareas simples y amigables para niños. Utilizando la biblioteca Flet en Python, implementé una interfaz de usuario intuitiva y personalizable, junto con una biblioteca personalizada de checkboxes para mejorar la interactividad. La app destaca por su enfoque en la usabilidad y la versatilidad de Python para el desarrollo de aplicaciones complejas y de rápida implementación.",
      "url": "https://github.com/CandyGZ/ToDoList-Flet",
      "created_at": "2023-10-23T17:05:04+00:00",
      "updated_at": "2025-10-05T13:32:48+00:00",
      "languages": {
        "Python": 14432
      },
      "technologies": [],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Virtual-Disk",
      "description": "Proyecto Virtual-Disk: Implementación en Python de un simulador de almacenamiento en bloques, similar a Amazon EBS. Destaca la clase SimpleBlockStorage como controlador central, creando un \"disco virtual\" en mi_disco.dat y permitiendo la escritura y lectura eficiente de datos en bloques numerados. Este enfoque, basado en la manipulación directa de datos según su posición numérica, refleja la eficacia de sistemas como Amazon EBS o discos duros convencionales.",
      "url": "https://github.com/CandyGZ/Virtual-Disk",
      "created_at": "2025-08-25T18:20:25+00:00",
      "updated_at": "2025-10-05T13:30:51+00:00",
      "languages": {
        "Python": 2193
      },
      "technologies": [],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "API-detalles-producto",
      "description": "Proyecto: API-detalles-producto\nDescripción mejorada: Desarrollé una API backend altamente eficiente para soportar páginas de detalle de productos, inspirada en plataformas de e-commerce. Esta API REST, construida con Spring Boot y Java 17, proporciona de forma rápida y precisa todos los detalles necesarios de los productos, permitiendo a los usuarios acceder a información detallada de manera efectiva. Tecnologías clave incluyen Spring Boot, Java 17, Jackson para JSON y SLF4J, garantizando un funcionamiento óptimo y una integración sin fisuras con sistemas automatizados.",
      "url": "https://github.com/CandyGZ/API-detalles-producto",
      "created_at": "2025-09-17T04:04:42+00:00",
      "updated_at": "2025-10-05T13:28:45+00:00",
      "languages": {
        "Java": 39547
      },
      "technologies": [
        "Java",
        "Maven"
      ],
      "stars": 0,
      "commits": 9,
      "topics": [
        "api",
        "api-rest"
      ]
    },
    {
      "name": "ShapeCalculator",
      "description": "**Proyecto ShapeCalculator: Calculadora de Formas Geométricas en Python**\nEl proyecto ShapeCalculator es una aplicación de línea de comandos que permite calcular áreas, perímetros, diagonales y la inclusión de formas geométricas. Escrito en Python, este programa es ideal para estudiantes, ingenieros y matemáticos que buscan realizar cálculos precisos de formas comunes de manera eficiente. Con una estructura clara de archivos y pruebas automatizadas, ShapeCalculator garantiza resultados exactos y confiables para diversas aplicaciones técnicas.",
      "url": "https://github.com/CandyGZ/ShapeCalculator",
      "created_at": "2023-09-23T03:21:45+00:00",
      "updated_at": "2025-10-05T13:27:34+00:00",
      "languages": {
        "Python": 10533
      },
      "technologies": [],
      "stars": 1,
      "commits": 7,
      "topics": []
    },
    {
      "name": "CV_reviewer",
      "description": "CV_reviewer\" es un sistema automatizado para revisar y analizar currículums vitae, facilitando la identificación de habilidades clave y experiencias relevantes para perfiles laborales específicos. Utilizando algoritmos de procesamiento de lenguaje natural, este proyecto mejora la eficiencia en la selección de candidatos al destacar aspectos destacados en los CVs.",
      "url": "https://github.com/CandyGZ/CV_reviewer",
      "created_at": "2025-10-05T02:13:02+00:00",
      "updated_at": "2025-10-05T02:13:03+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "Code-to-Mermaid-generator",
      "description": "Desarrollé un script en TypeScript, denominado Code-to-Mermaid-generator, que transforma tu proyecto en sintaxis Mermaid para Draw.io. Este script analiza tu código en busca de patrones clave, construye un modelo interno de la aplicación basado en decoradores y conexiones, y genera un diagrama visual de tus componentes y sus interacciones. Utiliza expresiones regulares para identificar relaciones tanto en el backend (NestJS) como en el frontend (Next.js), simplificando así la visualización de la arquitectura de tu proyecto.",
      "url": "https://github.com/CandyGZ/Code-to-Mermaid-generator",
      "created_at": "2025-09-20T14:26:42+00:00",
      "updated_at": "2025-09-28T11:54:29+00:00",
      "languages": {
        "TypeScript": 8565
      },
      "technologies": [],
      "stars": 0,
      "commits": 5,
      "topics": []
    },
    {
      "name": "VaadinToHTML",
      "description": "Proyecto: VaadinToHTML\n\nTransformación de una aplicación legacy Vaadin 8 en una SPA moderna sin reescribir la lógica de negocio. Esta re-arquitectura innovadora permitió superar la obsolescencia tecnológica y el acoplamiento UI-backend, rescatando una aplicación robusta y compleja. Utilizando herramientas avanzadas y estrategias de migración inteligentes, se logró actualizar la tecnología manteniendo la funcionalidad original intacta.",
      "url": "https://github.com/CandyGZ/VaadinToHTML",
      "created_at": "2025-09-27T05:17:13+00:00",
      "updated_at": "2025-09-27T15:56:55+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 6,
      "topics": []
    },
    {
      "name": "CV-reviewer",
      "description": "Proyecto CV-reviewer: Plataforma que utiliza inteligencia artificial para revisar y mejorar CVs automáticamente. Desarrollado con JavaScript, Python, HTML y CSS, integrando tecnologías como npm y Node.js para ofrecer una experiencia eficiente y precisa en la optimización de currículums.",
      "url": "https://github.com/CandyGZ/CV-reviewer",
      "created_at": "2025-09-23T19:39:05+00:00",
      "updated_at": "2025-09-24T19:01:27+00:00",
      "languages": {
        "JavaScript": 22596,
        "Python": 15045,
        "HTML": 1721,
        "CSS": 366
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "Subasteria",
      "description": "Proyecto Subasteria: Plataforma para encontrar la oferta más alta de manera única y eficiente. Desarrollado con TypeScript, JavaScript, CSS y Shell, utilizando Docker Compose para la gestión de contenedores. Su funcionalidad principal se centra en facilitar la búsqueda y adquisición de ofertas destacadas.",
      "url": "https://github.com/CandyGZ/Subasteria",
      "created_at": "2025-09-14T23:49:33+00:00",
      "updated_at": "2025-09-23T15:33:24+00:00",
      "languages": {
        "TypeScript": 108757,
        "Dockerfile": 1909,
        "JavaScript": 477,
        "Shell": 430,
        "CSS": 277
      },
      "technologies": [
        "Docker Compose"
      ],
      "stars": 0,
      "commits": 8,
      "topics": []
    },
    {
      "name": "Bartola",
      "description": "Desarrollé Bartola, un Gestor Financiero Personal basado en Django para el seguimiento detallado de ingresos, gastos y estrategias de pago. Esta aplicación web, construida con CSS, Python, SCSS, HTML, JavaScript y PHP, permite una gestión eficiente de las finanzas personales. Destaca por su capacidad de planificación financiera y su funcionalidad intuitiva, facilitando el control y la organización de las finanzas de manera efectiva.",
      "url": "https://github.com/CandyGZ/Bartola",
      "created_at": "2025-09-09T16:33:23+00:00",
      "updated_at": "2025-09-11T19:14:41+00:00",
      "languages": {
        "CSS": 131280,
        "Python": 115300,
        "SCSS": 113215,
        "HTML": 109797,
        "JavaScript": 27734,
        "PHP": 2124
      },
      "technologies": [
        "Python",
        "pip",
        "Django"
      ],
      "stars": 0,
      "commits": 8,
      "topics": []
    },
    {
      "name": "Email_notifier",
      "description": "Proyecto Email_notifier: Herramienta de notificación por correo electrónico para gestionar tareas diarias de forma eficiente y oportuna. Desarrollado con tecnologías modernas para garantizar una comunicación efectiva y personalizada. Utiliza Python para la automatización de envíos y ofrece una interfaz intuitiva para configurar recordatorios personalizados.",
      "url": "https://github.com/CandyGZ/Email_notifier",
      "created_at": "2025-09-01T14:59:18+00:00",
      "updated_at": "2025-09-01T14:59:19+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "EnglishTeacher",
      "description": "Proyecto \"EnglishTeacher\": Aplicación desarrollada en Python que brinda un enfoque personalizado para el aprendizaje del idioma inglés. Destaca por sus algoritmos de recomendación de lecciones basados en el progreso del usuario y su interfaz intuitiva. Los detalles técnicos se detallan en el README del repositorio.",
      "url": "https://github.com/CandyGZ/EnglishTeacher",
      "created_at": "2023-10-02T23:22:27+00:00",
      "updated_at": "2025-08-25T18:31:48+00:00",
      "languages": {
        "Python": 9767
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "neocoins2",
      "description": "Proyecto \"neocoins2\": Plataforma de gestión de criptomonedas que permite a los usuarios monitorear y administrar sus inversiones de forma segura y eficiente. Destaca por su interfaz intuitiva, gráficos en tiempo real y herramientas avanzadas de análisis.README: Utiliza una arquitectura basada en microservicios y tecnologías de cifrado robustas para garantizar la seguridad de los datos financieros.",
      "url": "https://github.com/CandyGZ/neocoins2",
      "created_at": "2025-04-17T20:55:03+00:00",
      "updated_at": "2025-04-17T20:55:03+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "NeoCoins",
      "description": "Desarrollé NeoCoins, un TradingGame que combina Python, HTML, JavaScript y CSS para crear una plataforma interactiva de intercambio de criptomonedas. Implementé funcionalidades avanzadas de trading virtual, ofreciendo a los usuarios una experiencia realista y educativa en el mundo de las inversiones digitales.",
      "url": "https://github.com/CandyGZ/NeoCoins",
      "created_at": "2025-04-17T02:27:12+00:00",
      "updated_at": "2025-04-17T02:58:00+00:00",
      "languages": {
        "Python": 13127,
        "HTML": 12068,
        "JavaScript": 3541,
        "CSS": 1109
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ValenteSys",
      "description": "Desarrollo de ValenteSys, un sistema web interactivo que combina JavaScript, HTML, Python y CSS para ofrecer una experiencia de usuario dinámica y atractiva. Destaca por su enfoque innovador en la presentación de datos y su arquitectura modular. ¡Descubre cómo la tecnología y la creatividad se unen en ValenteSys!",
      "url": "https://github.com/CandyGZ/ValenteSys",
      "created_at": "2025-04-09T19:29:02+00:00",
      "updated_at": "2025-04-10T18:40:07+00:00",
      "languages": {
        "JavaScript": 13020,
        "HTML": 11052,
        "Python": 9849,
        "CSS": 8782
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "DashboardIIMAS",
      "description": "Desarrollo de un panel interactivo para visualizar datos en tiempo real, utilizando Python para el back-end y HTML, JavaScript para el front-end. Destaca por su capacidad de análisis y presentación de información de forma intuitiva. Incorpora gráficos dinámicos y funcionalidades personalizables para una experiencia de usuario óptima.",
      "url": "https://github.com/CandyGZ/DashboardIIMAS",
      "created_at": "2025-03-14T01:56:59+00:00",
      "updated_at": "2025-03-14T01:58:53+00:00",
      "languages": {
        "Python": 25384,
        "HTML": 10758,
        "JavaScript": 1780
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "dashboard",
      "description": "Proyecto: Sistema de Autenticación Django utilizando SQLite\nEste proyecto implementa un sólido sistema de autenticación utilizando Django y SQLite, ofreciendo funcionalidades clave como registro de usuarios, autenticación segura, gestión de sesiones y manejo de contraseñas. Destacando tecnologías como Django, SQLite y HTML/JavaScript, proporciona una base confiable para el desarrollo de aplicaciones web seguras y escalables.",
      "url": "https://github.com/CandyGZ/dashboard",
      "created_at": "2025-03-07T17:33:11+00:00",
      "updated_at": "2025-03-07T18:42:39+00:00",
      "languages": {
        "Python": 19874,
        "HTML": 10758,
        "JavaScript": 1780
      },
      "technologies": [
        "Python",
        "pip",
        "Django"
      ],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "PlagueDetectorID",
      "description": "PlagueDetectorID es un software de reconocimiento de plagas que utiliza Python, C, Cython, C++, Fortran y otras tecnologías para identificar y clasificar pestes de forma eficiente. Con una combinación de lenguajes y tecnologías, este proyecto destaca por su capacidad de detección precisa y rápida. Además, su estructura modular y documentación detallada facilitan su uso y mantenimiento.",
      "url": "https://github.com/CandyGZ/PlagueDetectorID",
      "created_at": "2025-02-13T18:35:31+00:00",
      "updated_at": "2025-02-17T19:35:47+00:00",
      "languages": {
        "Python": 14755666,
        "C": 386605,
        "Cython": 125737,
        "C++": 85980,
        "Fortran": 37029,
        "PowerShell": 25697,
        "HTML": 16287,
        "Meson": 4589,
        "Batchfile": 1389
      },
      "technologies": [
        "Python",
        "pip"
      ],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "PestRecognition",
      "description": "Proyecto PestRecognition: Software de reconocimiento de plagas desarrollado en Python. Esta herramienta innovadora permite identificar y clasificar plagas de forma eficiente, facilitando la gestión y control de infestaciones. Utiliza algoritmos avanzados para analizar imágenes y proporciona resultados precisos en tiempo real.",
      "url": "https://github.com/LEAI-IIMAS/PestRecognition",
      "created_at": "2024-05-09T22:59:37+00:00",
      "updated_at": "2024-05-10T00:07:11+00:00",
      "languages": {
        "Python": 8055
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Weather-cards",
      "description": "Proyecto Weather-cards: Desarrollo de una aplicación web utilizando React y componentes funcionales, con estilos modulares y CSS para mostrar tarjetas meteorológicas. Utiliza tecnologías como npm, Node.js y React, con énfasis en la implementación de estilos atractivos y funcionales. Destaca por su enfoque en la visualización de datos de manera clara y efectiva, utilizando JavaScript, HTML y CSS junto con herramientas de desarrollo como Shell.",
      "url": "https://github.com/CandyGZ/Weather-cards",
      "created_at": "2022-06-30T04:57:17+00:00",
      "updated_at": "2023-10-05T18:03:35+00:00",
      "languages": {
        "JavaScript": 5368,
        "HTML": 4651,
        "CSS": 3176,
        "Shell": 53
      },
      "technologies": [
        "npm",
        "Node.js",
        "React"
      ],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "countclicker",
      "description": "Proyecto \"countclicker\": Aplicación web desarrollada con CSS, JavaScript y HTML para contar y registrar clics de manera interactiva. Destaca por su interfaz intuitiva y funcionalidad de seguimiento preciso. El README detalla el uso de eventos de clic, manipulación del DOM y almacenamiento local para una experiencia de usuario eficiente.",
      "url": "https://github.com/CandyGZ/countclicker",
      "created_at": "2022-07-09T04:26:14+00:00",
      "updated_at": "2023-10-05T18:03:30+00:00",
      "languages": {
        "CSS": 2062,
        "JavaScript": 1941,
        "HTML": 1662
      },
      "technologies": [],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "2DoList",
      "description": "Desarrollé 2DoList, una aplicación web para gestionar tareas usando JavaScript, HTML y CSS. Destaca por su estilo de escritura manual, fondos de papel y la integración de fuentes de Google para una experiencia única. Perfecto para organizarse de manera divertida y eficiente.",
      "url": "https://github.com/CandyGZ/2DoList",
      "created_at": "2022-08-02T23:51:54+00:00",
      "updated_at": "2023-10-05T18:03:25+00:00",
      "languages": {
        "JavaScript": 8890,
        "HTML": 7983,
        "CSS": 1969
      },
      "technologies": [],
      "stars": 1,
      "commits": 4,
      "topics": []
    },
    {
      "name": "ArithmeticArranger",
      "description": "Proyecto: ArithmeticArranger\nDesarrollado para FreeCodeCamp, ArithmeticArranger es una aplicación en Python que permite organizar y mostrar operaciones aritméticas de manera clara y ordenada. El proyecto incluye dos archivos: arithmetic_arranger con la funcionalidad básica y arithmetic_arrangerVWork con mejoras usando zip y maps. Aunque el segundo archivo no pasa las pruebas de FreeCodeCamp, sirve como un ejemplo avanzado para optimizar el código y evitar repeticiones.",
      "url": "https://github.com/CandyGZ/ArithmeticArranger",
      "created_at": "2023-09-17T20:43:09+00:00",
      "updated_at": "2023-10-05T18:03:21+00:00",
      "languages": {
        "Python": 5679
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "Time_Calculator",
      "description": "Desarrollé el proyecto Time_Calculator en Python para calcular la hora final basada en una hora y minutos dados, junto con una duración específica en horas y minutos. Esta aplicación es útil para realizar cálculos precisos de tiempo de manera eficiente. El proyecto presenta una funcionalidad clave para la gestión del tiempo, implementada con Python de manera efectiva y robusta.",
      "url": "https://github.com/CandyGZ/Time_Calculator",
      "created_at": "2023-09-20T19:42:21+00:00",
      "updated_at": "2023-10-05T18:03:19+00:00",
      "languages": {
        "Python": 6761
      },
      "technologies": [],
      "stars": 1,
      "commits": 1,
      "topics": []
    },
    {
      "name": "FCC-BudgetApp",
      "description": "Desarrollé la aplicación FCC-BudgetApp en Python, una herramienta especializada en administración de presupuestos con categorías y gráficos visuales. Su funcionalidad central radica en ofrecer una interfaz intuitiva para el seguimiento detallado de gastos y visualización de datos financieros.",
      "url": "https://github.com/CandyGZ/FCC-BudgetApp",
      "created_at": "2023-09-22T16:47:57+00:00",
      "updated_at": "2023-10-05T18:03:15+00:00",
      "languages": {
        "Python": 22705
      },
      "technologies": [],
      "stars": 1,
      "commits": 2,
      "topics": []
    },
    {
      "name": "FCC-ProbabilityCalc",
      "description": "Proyecto FCC-ProbabilityCalc: Desarrollo en Python para calcular las probabilidades de obtener un número específico de bolas al elegir x cantidad al azar de un sombrero n veces. Esta herramienta técnica permite analizar escenarios de probabilidad con precisión y eficiencia, facilitando la toma de decisiones fundamentadas. Funcionalidades clave incluyen cálculo de combinaciones y permutaciones.",
      "url": "https://github.com/CandyGZ/FCC-ProbabilityCalc",
      "created_at": "2023-09-26T23:55:40+00:00",
      "updated_at": "2023-10-05T18:03:00+00:00",
      "languages": {
        "Python": 5213
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "LandingPage-Pikachu",
      "description": "Proyecto: LandingPage-Pikachu\nDescripción: LandingPage-Pikachu es una página de aterrizaje interactiva con temática de Pikachu, destacando por su animación de bolas que simulan los icónicos Pokeballs con efectos realistas de gravedad y rebote. Desarrollado con HTML, CSS y JavaScript, este proyecto ofrece una experiencia visual única con animaciones de caída, rebote elástico y detención natural de las bolas, demostrando habilidades técnicas en la implementación de dinámicas físicas en la web.",
      "url": "https://github.com/CandyGZ/LandingPage-Pikachu",
      "created_at": "2023-10-05T17:34:31+00:00",
      "updated_at": "2023-10-05T18:02:29+00:00",
      "languages": {
        "HTML": 4524
      },
      "technologies": [],
      "stars": 1,
      "commits": 3,
      "topics": []
    },
    {
      "name": "repositorio-henry",
      "description": "Proyecto: repositorio-henry\n\nDesarrollado como parte de un proyecto académico, repositorio-henry es una plataforma que facilita la gestión y revisión de tareas y trabajos prácticos. Utilizando tecnologías modernas y metodologías ágiles, este sistema permite a los usuarios subir, revisar y calificar tareas de manera eficiente. Entre sus funcionalidades clave se encuentran la gestión de usuarios, la asignación de tareas y la retroalimentación en tiempo real.",
      "url": "https://github.com/CandyGZ/repositorio-henry",
      "created_at": "2022-04-13T20:48:19+00:00",
      "updated_at": "2022-06-25T18:00:27+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    },
    {
      "name": "M1-Challenge",
      "description": "Proyecto \"M1-Challenge\": Desarrollo de ejercicios prácticos en JavaScript utilizando npm y Node.js. El objetivo es completar el código en distintos archivos para que pasen los tests predefinidos. El proyecto brinda una oportunidad para poner en práctica habilidades de programación y lógica, con un enfoque en la resolución de problemas concretos.",
      "url": "https://github.com/CandyGZ/M1-Challenge",
      "created_at": "2022-06-17T18:24:36+00:00",
      "updated_at": "2022-06-17T18:26:09+00:00",
      "languages": {
        "JavaScript": 25434
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Henry-M1",
      "description": "Proyecto \"Henry-M1\": Plataforma educativa para el aprendizaje de fundamentos de JavaScript, utilizando tecnologías como JavaScript, Nunjucks, HTML y Python. Incluye módulos de estudio, proceso de subida de trabajos y recursos extras como patrones de JavaScript y manejo de errores. Se puede acceder al contenido completo del repositorio a través de `npm install` y `npm start`.",
      "url": "https://github.com/CandyGZ/Henry-M1",
      "created_at": "2022-06-07T00:44:38+00:00",
      "updated_at": "2022-06-07T05:31:27+00:00",
      "languages": {
        "JavaScript": 102537,
        "Nunjucks": 6996,
        "HTML": 2529,
        "Python": 264
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 4,
      "topics": []
    },
    {
      "name": "2022-04-23-eevee147",
      "description": "Proyecto \"2022-04-23-eevee147\": Desafío técnico Henry Challenge sobre JavaScript para evaluar conceptos básicos. Requiere investigar por cuenta propia y resolver de manera individual. Tecnologías clave: JavaScript, npm, Node.js. Incluye pasos detallados en README para clonar el repositorio y completar el checkpoint.",
      "url": "https://github.com/soyhenry-checkpoints-4/2022-04-23-eevee147",
      "created_at": "2022-04-23T04:47:58+00:00",
      "updated_at": "2022-04-23T04:48:02+00:00",
      "languages": {
        "JavaScript": 15895
      },
      "technologies": [
        "npm",
        "Node.js"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Clase26",
      "description": "Proyecto Clase26 - angryBirdsAlum: Aplicación web que implementa Angry Birds stage 2 con Herencia de Clases e Imágenes. Desarrollado con JavaScript, HTML y CSS, destacando la funcionalidad de Inheritance y la integración de imágenes para una experiencia interactiva única.",
      "url": "https://github.com/CandyGZ/Clase26",
      "created_at": "2022-03-24T22:55:41+00:00",
      "updated_at": "2022-03-24T22:58:24+00:00",
      "languages": {
        "JavaScript": 342373,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProyectoAlumn43",
      "description": "Desarrollé el proyecto ProyectoAlumn43, una aplicación web diseñada para ser implementada por estudiantes en un entorno educativo. Este proyecto, creado con JavaScript, HTML y CSS, brinda la oportunidad de practicar la identificación y resolución de bugs, fomentando así el desarrollo de habilidades de depuración y análisis de código.",
      "url": "https://github.com/CandyGZ/ProyectoAlumn43",
      "created_at": "2022-03-22T20:43:09+00:00",
      "updated_at": "2022-03-22T20:44:44+00:00",
      "languages": {
        "JavaScript": 3733948,
        "HTML": 630,
        "CSS": 78
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "CarreradeAutos",
      "description": "Proyecto CarreradeAutos: Plataforma de carreras de autos en línea, desarrollada utilizando JavaScript, CSS y HTML. Destaca por su diseño interactivo y dinámico, ofreciendo a los usuarios una experiencia envolvente. Incorpora funcionalidades como selección de pistas, personalización de vehículos y marcadores en tiempo real.",
      "url": "https://github.com/CandyGZ/CarreradeAutos",
      "created_at": "2022-03-22T17:22:02+00:00",
      "updated_at": "2022-03-22T17:22:49+00:00",
      "languages": {
        "JavaScript": 150079,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "CanguroParte1",
      "description": "Proyecto CanguroParte1: Desarrollado con JavaScript, HTML y CSS, este proyecto tiene como objetivo completar la parte 1 según las instrucciones proporcionadas en sketch.js. Destaca por su enfoque técnico preciso y la implementación de funcionalidades clave en el desarrollo web.",
      "url": "https://github.com/CandyGZ/CanguroParte1",
      "created_at": "2022-03-18T01:12:18+00:00",
      "updated_at": "2022-03-18T01:13:29+00:00",
      "languages": {
        "JavaScript": 3296281,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Clase42-Alum",
      "description": "Proyecto Clase42-Alum es una aplicación web desarrollada con JavaScript, CSS y HTML que tiene como objetivo facilitar la gestión de alumnos en un entorno educativo. Destaca por su interfaz intuitiva y funciones de seguimiento académico. Detalles técnicos disponibles en el README.",
      "url": "https://github.com/CandyGZ/Clase42-Alum",
      "created_at": "2022-03-18T00:32:47+00:00",
      "updated_at": "2022-03-18T00:33:27+00:00",
      "languages": {
        "JavaScript": 148619,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Clase40-alum",
      "description": "Proyecto \"Clase40-alum\": Plataforma basada en JavaScript, CSS y HTML para la gestión de alumnos en el ámbito educativo. Destaca por su interfaz intuitiva y funcionalidades personalizables. El README incluye instrucciones detalladas de instalación y uso, así como información sobre la estructura del código y posibles mejoras a futuro.",
      "url": "https://github.com/CandyGZ/Clase40-alum",
      "created_at": "2022-03-17T22:26:57+00:00",
      "updated_at": "2022-03-17T22:27:31+00:00",
      "languages": {
        "JavaScript": 144398,
        "CSS": 1885,
        "HTML": 1278
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase41",
      "description": "Proyecto \"clase41\": Aplicación web desarrollada en JavaScript, CSS y HTML para la gestión de clases online. Permite a los alumnos acceder a material didáctico, interactuar con el profesor y realizar actividades de aprendizaje de forma intuitiva. Tecnologías clave incluyen JavaScript para la interactividad, CSS para el diseño y HTML para la estructura.",
      "url": "https://github.com/CandyGZ/clase41",
      "created_at": "2022-03-15T16:52:07+00:00",
      "updated_at": "2022-03-15T16:53:08+00:00",
      "languages": {
        "JavaScript": 147662,
        "CSS": 25696,
        "HTML": 1653
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase38",
      "description": "Proyecto clase38: Aplicación web en desarrollo que busca completar una funcionalidad específica. Utiliza JavaScript, HTML y CSS para lograr una interfaz interactiva y atractiva. Se espera que la implementación final aporte una solución efectiva y eficiente para la tarea pendiente.",
      "url": "https://github.com/CandyGZ/clase38",
      "created_at": "2022-03-11T17:24:30+00:00",
      "updated_at": "2022-03-11T17:25:05+00:00",
      "languages": {
        "JavaScript": 139979,
        "HTML": 1561,
        "CSS": 1230
      },
      "technologies": [],
      "stars": 0,
      "commits": 3,
      "topics": []
    },
    {
      "name": "Alumn-Clase40",
      "description": "Proyecto Alumn-Clase40 es una plataforma interactiva desarrollada con JavaScript, CSS y HTML, diseñada para mejorar la experiencia de aprendizaje en entornos educativos. Destaca por su enfoque innovador en la enseñanza, ofreciendo funcionalidades dinámicas y atractivas para los usuarios. Utiliza tecnologías modernas para garantizar un rendimiento óptimo y una navegación intuitiva.",
      "url": "https://github.com/CandyGZ/Alumn-Clase40",
      "created_at": "2022-03-10T15:48:48+00:00",
      "updated_at": "2022-03-10T15:49:52+00:00",
      "languages": {
        "JavaScript": 144398,
        "CSS": 1885,
        "HTML": 1278
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "StudClase38",
      "description": "Proyecto: StudClase38\nStudClase38 es una plataforma web interactiva diseñada para facilitar la enseñanza y el aprendizaje en entornos virtuales. Desarrollado con JavaScript, HTML y CSS, este proyecto permite a los usuarios completar actividades educativas de forma dinámica y personalizada. Con funcionalidades como la interacción en tiempo real y la facilidad de uso, StudClase38 brinda una experiencia educativa enriquecedora y efectiva.",
      "url": "https://github.com/CandyGZ/StudClase38",
      "created_at": "2022-03-01T22:15:18+00:00",
      "updated_at": "2022-03-01T22:16:08+00:00",
      "languages": {
        "JavaScript": 207478,
        "HTML": 1516,
        "CSS": 86
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clase24",
      "description": "Proyecto \"clase24\": Desarrollo de la etapa final de una clase con enfoque en Angry Birds. Implementado con JavaScript, HTML y CSS. README incluye extracto \"# angryBirdsStage1 - Stage 1 Angry Birds\".",
      "url": "https://github.com/CandyGZ/clase24",
      "created_at": "2022-02-24T23:57:21+00:00",
      "updated_at": "2022-02-24T23:58:25+00:00",
      "languages": {
        "JavaScript": 343414,
        "HTML": 545,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Sangria",
      "description": "Proyecto Sangria: Desarrollo de un ejercicio técnico utilizando JavaScript, HTML y CSS para crear una aplicación web interactiva. Este proyecto destaca por su enfoque en la práctica de programación front-end y la integración de tecnologías web clave. Funcionalidades principales incluyen la manipulación dinámica de elementos HTML, estilos CSS personalizados y la implementación de lógica de programación en JavaScript para mejorar la experiencia del usuario.",
      "url": "https://github.com/CandyGZ/Sangria",
      "created_at": "2022-02-18T18:43:36+00:00",
      "updated_at": "2022-02-18T18:44:28+00:00",
      "languages": {
        "JavaScript": 3292834,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "P-ndulo",
      "description": "Proyecto P-ndulo: Aplicación de péndulo desarrollada en JavaScript y HTML. El proyecto NC27 ofrece una simulación interactiva y educativa de un péndulo, mostrando conceptos de física de manera visual. Utiliza tecnologías web para brindar una experiencia de aprendizaje envolvente.",
      "url": "https://github.com/CandyGZ/P-ndulo",
      "created_at": "2022-02-09T00:52:01+00:00",
      "updated_at": "2022-02-09T00:54:21+00:00",
      "languages": {
        "JavaScript": 5294186,
        "HTML": 570
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "clasr27full",
      "description": "Desarrollo de una aplicación web interactiva \"clasr27full\" utilizando JavaScript y HTML para facilitar la clasificación de datos de forma eficiente y precisa. Destaca por su interfaz intuitiva y capacidad de procesamiento rápido. El proyecto incorpora algoritmos de clasificación avanzados para optimizar la precisión del resultado.",
      "url": "https://github.com/CandyGZ/clasr27full",
      "created_at": "2022-01-26T01:45:30+00:00",
      "updated_at": "2022-01-26T01:46:07+00:00",
      "languages": {
        "JavaScript": 2331,
        "HTML": 625
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "c29stud",
      "description": "Desarrollo del proyecto \"c29stud\" que emplea JavaScript, HTML y CSS para su implementación. Este proyecto, enfocado en AngryBirdsStage4, destaca por su uso innovador de tecnologías web para crear una experiencia interactiva única. El README incluye detalles sobre la versión y el propósito del juego.",
      "url": "https://github.com/CandyGZ/c29stud",
      "created_at": "2022-01-20T19:33:06+00:00",
      "updated_at": "2022-01-20T19:34:29+00:00",
      "languages": {
        "JavaScript": 353620,
        "HTML": 629,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "RefClase28",
      "description": "Proyecto RefClase28: Plataforma de desarrollo web (JavaScript, HTML, CSS) que destaca por su implementación de AngryBirdsStage4. Su README muestra un enfoque técnico sólido y detallado, resaltando el uso de tecnologías clave para lograr funcionalidades avanzadas en el proyecto.",
      "url": "https://github.com/CandyGZ/RefClase28",
      "created_at": "2022-01-19T00:55:25+00:00",
      "updated_at": "2022-01-19T00:56:18+00:00",
      "languages": {
        "JavaScript": 353610,
        "HTML": 629,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C28v1-Prof",
      "description": "Desarrollé el proyecto C28v1-Prof, una clase completa utilizando JavaScript, HTML y CSS para ofrecer una experiencia dinámica y visualmente atractiva. Este proyecto destaca por su enfoque técnico sólido, combinando funcionalidades interactivas y un diseño atractivo. Implementé tecnologías clave como JavaScript para la lógica de programación, HTML para la estructura del sitio y CSS para el diseño y estilo, asegurando un resultado final de alta calidad y profesionalismo.",
      "url": "https://github.com/CandyGZ/C28v1-Prof",
      "created_at": "2022-01-18T03:40:15+00:00",
      "updated_at": "2022-01-18T03:41:20+00:00",
      "languages": {
        "JavaScript": 706908,
        "HTML": 1254,
        "CSS": 92
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C28V1-Stud",
      "description": "Proyecto C28V1-Stud: Desarrollo de Resortera utilizando JavaScript, HTML y CSS. Destaca por introducir Constraints en Angry Birds Stage 3, ofreciendo una experiencia interactiva única. Tecnologías clave incluyen JavaScript para la lógica del juego y CSS para el diseño.",
      "url": "https://github.com/CandyGZ/C28V1-Stud",
      "created_at": "2022-01-18T03:38:11+00:00",
      "updated_at": "2022-01-18T03:39:55+00:00",
      "languages": {
        "JavaScript": 353298,
        "HTML": 625,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C21v2prof",
      "description": "Desarrollo del proyecto C21v2prof con JavaScript, HTML y CSS para crear una plataforma educativa interactiva. Destaca por su diseño intuitivo y funcionalidad didáctica. Incluye características como animaciones interactivas y estructura modular para facilitar la escalabilidad del sistema.",
      "url": "https://github.com/CandyGZ/C21v2prof",
      "created_at": "2022-01-16T20:34:12+00:00",
      "updated_at": "2022-01-16T23:08:53+00:00",
      "languages": {
        "JavaScript": 3734,
        "HTML": 1164,
        "CSS": 138
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C21v2-Stud",
      "description": "Proyecto \"C21v2-Stud\": Plataforma web interactiva desarrollada en JavaScript, HTML y CSS. Diseñada para facilitar el estudio y la práctica de conceptos educativos, destacando por su flexibilidad y usabilidad. Basado en el repositorio # C21_matterjs-Boilerplate.",
      "url": "https://github.com/CandyGZ/C21v2-Stud",
      "created_at": "2021-11-11T20:56:28+00:00",
      "updated_at": "2022-01-16T20:16:39+00:00",
      "languages": {
        "JavaScript": 1035,
        "HTML": 388,
        "CSS": 46
      },
      "technologies": [],
      "stars": 0,
      "commits": 10,
      "topics": []
    },
    {
      "name": "ProyectoP-nduloNewton",
      "description": "ProyectoP-nduloNewton es un proyecto en desarrollo diseñado para prácticas técnicas, enfocado en la implementación de un péndulo de Newton. Destaca por su potencial para mejorar habilidades en física y programación. Utiliza tecnologías modernas para simular el movimiento del péndulo y ofrece una experiencia de aprendizaje interactiva.",
      "url": "https://github.com/CandyGZ/ProyectoP-nduloNewton",
      "created_at": "2021-12-02T18:34:35+00:00",
      "updated_at": "2021-12-02T18:34:41+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Reference-AndryBirds-c25",
      "description": "Proyecto Reference-AndryBirds-c25: Desarrollo de Angry Birds stage 2 con Herencia de Clases e Imágenes, implementado en JavaScript, HTML y CSS. Este proyecto destaca por su estructura orientada a objetos y la integración de imágenes para una experiencia visual atractiva y dinámica en el juego.",
      "url": "https://github.com/CandyGZ/Reference-AndryBirds-c25",
      "created_at": "2021-12-01T00:42:48+00:00",
      "updated_at": "2021-12-01T00:45:50+00:00",
      "languages": {
        "JavaScript": 342311,
        "HTML": 567,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "C25",
      "description": "Proyecto \"C25\": Desarrollo de actividad estudiantil para Angry Birds Stage 2 utilizando JavaScript, HTML y CSS. Proporciona un enlace interactivo para que los estudiantes participen en la actividad y mejoren sus habilidades en programación web. El README indica que el proyecto se centra en la etapa 2 del juego y proporciona una experiencia práctica para los alumnos.",
      "url": "https://github.com/CandyGZ/C25",
      "created_at": "2021-12-01T00:07:15+00:00",
      "updated_at": "2021-12-01T00:09:14+00:00",
      "languages": {
        "JavaScript": 343599,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC21-Collision",
      "description": "ProC21-Collision\" es un algoritmo en JavaScript que detecta colisiones entre dos objetos, brindando una solución eficiente para este escenario. Utilizando HTML y CSS para la visualización, este proyecto se enfoca en la precisión de la detección y la optimización del rendimiento. Según el README, se destaca su función principal de detectar colisiones de manera efectiva.",
      "url": "https://github.com/CandyGZ/ProC21-Collision",
      "created_at": "2021-11-11T20:58:00+00:00",
      "updated_at": "2021-11-30T22:08:14+00:00",
      "languages": {
        "JavaScript": 3293010,
        "HTML": 352,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "ProC25Reference",
      "description": "ProC25Reference\" es un proyecto que proporciona una referencia centralizada para el estándar ProC25. Su valor radica en facilitar el acceso rápido a información detallada y actualizada sobre este estándar. Entre sus características se incluyen una interfaz intuitiva, búsqueda avanzada y organización estructurada de contenidos.",
      "url": "https://github.com/CandyGZ/ProC25Reference",
      "created_at": "2021-11-26T01:10:46+00:00",
      "updated_at": "2021-11-26T01:11:08+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC25V1",
      "description": "Desarrollo de la actividad estudiantil Angry Birds Stage 2, denominada ProC25V1, enfocada en la práctica de conceptos de JavaScript, HTML y CSS. El proyecto ofrece a los estudiantes la oportunidad de aplicar y mejorar sus habilidades de programación web, utilizando tecnologías clave para la creación de una etapa interactiva inspirada en el popular juego.README: # angryBirdsStage2StudentActivity.",
      "url": "https://github.com/CandyGZ/ProC25V1",
      "created_at": "2021-11-25T05:33:49+00:00",
      "updated_at": "2021-11-25T05:34:52+00:00",
      "languages": {
        "JavaScript": 343599,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "ProC24",
      "description": "ProC24 es un emocionante proyecto inspirado en Angry Birds, desarrollado utilizando JavaScript, HTML y CSS. TopplingBoxes es una aplicación que desafía la física, donde el objetivo es derribar cajas estratégicamente. Con un enfoque en la interactividad y la jugabilidad, este proyecto destaca por su uso creativo de tecnologías web para una experiencia única y entretenida.",
      "url": "https://github.com/CandyGZ/ProC24",
      "created_at": "2021-11-23T03:01:09+00:00",
      "updated_at": "2021-11-23T03:01:49+00:00",
      "languages": {
        "JavaScript": 340795,
        "HTML": 427,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "C22-V1",
      "description": "Proyecto C22-V1: Desarrollo de una Bouncy Ball con matter.js. Proyecto creativo que combina JavaScript, HTML y CSS para crear una experiencia interactiva. La física del motor matter.js permite una simulación realista del rebote de la pelota, destacando el dominio técnico en la implementación de elementos dinámicos en la web.",
      "url": "https://github.com/CandyGZ/C22-V1",
      "created_at": "2021-11-23T02:29:40+00:00",
      "updated_at": "2021-11-23T02:31:01+00:00",
      "languages": {
        "JavaScript": 3632099,
        "HTML": 398,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Angrybirds-Stage2.5",
      "description": "Implementación de Angry Birds stage 2.5 con herencia de clases e imágenes, utilizando JavaScript, HTML y CSS. Destaca por su funcionalidad avanzada y mejora la experiencia de usuario a través de una interfaz visualmente atractiva.",
      "url": "https://github.com/CandyGZ/Angrybirds-Stage2.5",
      "created_at": "2021-11-18T19:05:02+00:00",
      "updated_at": "2021-11-18T19:05:35+00:00",
      "languages": {
        "JavaScript": 342452,
        "HTML": 587,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Topplingboxes",
      "description": "Proyecto \"TopplingBoxes\": Aplicación web desarrollada con JavaScript, HTML y CSS para simular el efecto de cajas que caen al azar. Destaca por su interactividad y dinamismo. Incluye un README con información detallada sobre su funcionamiento y uso.",
      "url": "https://github.com/CandyGZ/Topplingboxes",
      "created_at": "2021-11-18T19:03:41+00:00",
      "updated_at": "2021-11-18T19:04:10+00:00",
      "languages": {
        "JavaScript": 340787,
        "HTML": 427,
        "CSS": 42
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "MotoresF",
      "description": "Proyecto MotoresF: Boilerplate de motores físicos en JavaScript, HTML y CSS, diseñado para acelerar el desarrollo de proyectos p5.play. Este boilerplate proporciona una base sólida para la implementación de motores físicos en aplicaciones web, promoviendo la eficiencia y la calidad del código. Tecnologías clave: JavaScript, HTML, CSS.",
      "url": "https://github.com/CandyGZ/MotoresF",
      "created_at": "2021-11-16T02:22:04+00:00",
      "updated_at": "2021-11-16T02:22:56+00:00",
      "languages": {
        "JavaScript": 3631520,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "Trex-color",
      "description": "Proyecto Trex-color: Desarrollé un juego del Trex a color utilizando JavaScript, HTML y CSS para ofrecer una experiencia visualmente atractiva y divertida. Implementé funcionalidades interactivas como saltos, esquivar obstáculos y contadores de puntuación para mejorar la jugabilidad.",
      "url": "https://github.com/CandyGZ/Trex-color",
      "created_at": "2021-10-21T22:44:29+00:00",
      "updated_at": "2021-10-21T22:46:19+00:00",
      "languages": {
        "JavaScript": 3297112,
        "HTML": 354,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "Trex",
      "description": "Proyecto: Trex JavaScript Game\nDesarrollé Trex, un juego interactivo programado en JavaScript con integración de HTML y CSS. El proyecto destaca por su dinamismo y desafíos de programación, ofreciendo una experiencia de juego cautivadora. Las funcionalidades clave incluyen controles de teclado, detección de colisiones y animaciones fluidas.",
      "url": "https://github.com/CandyGZ/Trex",
      "created_at": "2021-10-04T21:39:15+00:00",
      "updated_at": "2021-10-21T22:41:03+00:00",
      "languages": {
        "JavaScript": 3295765,
        "HTML": 351,
        "CSS": 71
      },
      "technologies": [],
      "stars": 0,
      "commits": 2,
      "topics": []
    },
    {
      "name": "workshop-todo-native-mobile",
      "description": "Desarrollo de una aplicación Todo List en React Native, integrando una base de datos de DataStax AstraDB y desplegando en Netlify. El proyecto permite la gestión de tareas en dispositivos móviles Android e iOS, así como en navegadores web, utilizando tecnologías como npm, Node.js y React. Incluye una interfaz intuitiva y funcionalidades avanzadas para una experiencia de usuario óptima.",
      "url": "https://github.com/CandyGZ/workshop-todo-native-mobile",
      "created_at": "2021-08-26T15:26:03+00:00",
      "updated_at": "2021-08-26T15:29:30+00:00",
      "languages": {
        "JavaScript": 19748,
        "Shell": 201
      },
      "technologies": [
        "npm",
        "Node.js",
        "React"
      ],
      "stars": 0,
      "commits": 145,
      "topics": []
    },
    {
      "name": "t-rex",
      "description": "Proyecto \"t-rex\": Aplicación web desarrollada con TypeScript, SCSS, HTML y JavaScript, utilizando npm, Node.js y Angular. Destaca por su enfoque en la creación de interfaces interactivas y dinámicas, combinando tecnologías modernas para ofrecer una experiencia de usuario fluida y atractiva.",
      "url": "https://github.com/CandyGZ/t-rex",
      "created_at": "2021-08-17T13:48:20+00:00",
      "updated_at": "2021-08-17T13:48:43+00:00",
      "languages": {
        "TypeScript": 16844,
        "SCSS": 8476,
        "HTML": 2599,
        "JavaScript": 2325
      },
      "technologies": [
        "npm",
        "TypeScript",
        "Node.js",
        "Angular"
      ],
      "stars": 0,
      "commits": 1,
      "topics": []
    },
    {
      "name": "WebAdminFraccionamientos",
      "description": "Proyecto \"WebAdminFraccionamientos\": Integración de HybridMenu en Vaadin 8 con Spring Boot para crear menús dinámicos. Permite agregar elementos y vistas personalizadas fácilmente. Tecnologías clave: CSS, Java, TSQL, Maven. Funcionalidad destacada: soporte completo de SpringNavigator.",
      "url": "https://github.com/saulnoelm/WebAdminFraccionamientos",
      "created_at": "2019-05-23T05:35:11+00:00",
      "updated_at": "2020-03-26T03:37:06+00:00",
      "languages": {
        "CSS": 1572667,
        "Java": 1370099,
        "TSQL": 407498
      },
      "technologies": [
        "Java",
        "Maven"
      ],
      "stars": 0,
      "commits": 159,
      "topics": []
    },
    {
      "name": "anac",
      "description": "Desarrollo de un sistema de gestión de contenido flexible y escalable para facilitar la creación y administración de información de manera eficiente. Destaca por su capacidad para adaptarse a las necesidades de cada usuario, ofreciendo una interfaz intuitiva y funcionalidades personalizables. El proyecto se basa en una arquitectura modular que permite la fácil integración de nuevas funcionalidades y extensiones.",
      "url": "https://github.com/CandyGZ/anac",
      "created_at": "2019-10-25T04:53:27+00:00",
      "updated_at": "2019-10-25T04:53:27+00:00",
      "languages": {},
      "technologies": [],
      "stars": 0,
      "commits": 0,
      "topics": []
    }
  ],
  "languages": {
    "JavaScript": 61.76,
    "Python": 24.93,
    "CSS": 4.55,
    "TypeScript": 2.81,
    "Java": 2.15,
    "HTML": 0.68,
    "Blade": 0.67,
    "TSQL": 0.62,
    "C": 0.59,
    "PHP": 0.39,
    "Cython": 0.19,
    "SCSS": 0.19,
    "C++": 0.13,
    "PLpgSQL": 0.07,
    "Fortran": 0.06,
    "Solidity": 0.05,
    "Kotlin": 0.04,
    "PowerShell": 0.04,
    "Batchfile": 0.04,
    "Shell": 0.01,
    "Nunjucks": 0.01,
    "Meson": 0.01,
    "Dockerfile": 0.0,
    "Procfile": 0.0
  },
  "technologies": [
    "Angular",
    "Composer",
    "Django",
    "Docker",
    "Docker Compose",
    "Express.js",
    "FastAPI",
    "Flask",
    "Gradle",
    "Java",
    "Maven",
    "Next.js",
    "Node.js",
    "NumPy",
    "PHP",
    "Pandas",
    "Python",
    "React",
    "TypeScript",
    "npm",
    "pip"
  ],
  "generated_at": "2025-11-19T20:21:34.295258"
}